/*
 Navicat Premium Dump SQL

 Source Server         : GraduationProject
 Source Server Type    : MySQL
 Source Server Version : 80040 (8.0.40)
 Source Host           : localhost:3306
 Source Schema         : cultural_relic_system

 Target Server Type    : MySQL
 Target Server Version : 80040 (8.0.40)
 File Encoding         : 65001

 Date: 05/06/2026 12:13:27
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for artifact
-- ----------------------------
DROP TABLE IF EXISTS `artifact`;
CREATE TABLE `artifact`  (
  `artifact_id` bigint NOT NULL AUTO_INCREMENT COMMENT '文物ID',
  `artifact_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '文物名称',
  `author` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT '佚名' COMMENT '作者/匠人',
  `category` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '类别(如：瓷器、书画、青铜器)',
  `dynasty` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '朝代',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '文物详细描述',
  `image_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '主图URL',
  `status` tinyint NULL DEFAULT 0 COMMENT '状态: 0-馆藏中, 1-外借巡展中, 2-维修保养中',
  `storage_location` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '存放位置',
  `owner_museum` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '所属博物馆',
  `current_location` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '当前所在地(若为空则表示在原馆)',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP COMMENT '录入时间',
  PRIMARY KEY (`artifact_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 229 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '文物信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of artifact
-- ----------------------------
INSERT INTO `artifact` VALUES (1, '青花瓷瓶', '佚名', '瓷器', '元代', '白釉青花点笔浓，冰肌玉骨自沉香。\n\n作为中国瓷器史上最耀眼的符号，青花瓷瓶，用最纯粹的两种色彩，勾勒出了东方美学的最高境界。\n\n从工艺科普的视角来看，它是极为经典的釉下彩传奇。匠人们用含氧化钴的苏麻离青等天然钴料，在素白的泥胎上纵笔挥洒，随后罩上一层透明釉，经1300度的高温一次烧成。那晕染开来的蓝色，深沉时如墨落幽潭，翠透时如雨后初晴。更因其独特的烧制工艺，使得发色永不褪色，真正实现了“白青相映，历久弥新”。\n\n它的美，在于**“繁花落尽见真淳”**。瓶身之上，无论是缠枝牡丹的富贵，还是山水人物的隐逸，都被过滤成了素雅的蓝与白。\n\n抚摸着细腻如玉的瓶身，如同抚摸一段被烈火凝固的河流。青花瓷瓶不仅是一件盛装岁月的雅器，更是一首用泥土与火写就的视觉诗篇，惊艳了时光，也温柔了惊鸿。', 'http://localhost:8080/files/e0d5675c-c8e2-47eb-80cb-22d4875def42.png', 1, 'C栋一层展厅214', '河北博物馆', '河北博物馆', '2026-02-23 15:15:01');
INSERT INTO `artifact` VALUES (3, '烟雨瓷瓶', '佚名', '瓷器', '元代', '烟雨瓷瓶，是一场将江南春汛定格于泥土与烈火中的浪漫视觉。\n\n从工艺上看，它多采用天青或粉青釉色为底，运用独特的窑变、泼墨分水或晕染技法。在近千度的高温淬炼下，釉料在胎体上自然流动、晕散，如同水墨入水，幻化出如丝如缕的朦胧雾气与层层叠叠的远山暮色。出窑那一刻，原本冰冷坚硬的瓷器，竟有了烟雨江南“山色空蒙雨亦奇”的流动感。\n\n它的美，在于“虚实相生”。不着一字，不见一滴雨，却凭借釉色的浓淡交织，让人仿佛能听见雨打芭蕉的清脆，看见乌篷船划破波光的微澜。\n\n展卷迎风，一瓶在侧。它不仅是一件装点空间的雅器，更是一扇开在凡尘中的窗——无需舟车劳顿，只要凝眸于这青白交织的釉面，心便已宿在了那浸润了千年的烟雨江南里。', 'http://localhost:8080/files/1fca5e11-4ff7-4d3c-b509-f25f1ed51037.png', 0, '1库房', '河北博物馆', '1库房', '2026-02-23 15:17:00');
INSERT INTO `artifact` VALUES (4, '千里江山图（摹本）', '王希孟', '绘画', '北宋', '天才少年一跃千年，青绿山水冠绝华夏。\n\n这是北宋十八岁少年王希孟，留在人间唯一的绝响——《千里江山图》。\n\n在纵11.9米的浩瀚长卷中，少年以惊世之才，科普了中国传统绘画中**“大青绿山水”的极致美学。他用珍贵的孔雀石**研磨成青，蓝铜矿提炼成绿，再辅以赭石与金粉，在绢本上层层敷色。历经千载，那抹青绿非但没有黯淡，反而愈发璀璨夺目。画面中烟波浩渺、层峦叠嶂，渔村野市、水榭亭台错落其间，将千里江山的雄浑与江南水乡的柔美完美融为一体。\n\n它的伟大，不仅在于“咫尺有千里之趣”的宏大构图，更在于那抹永不褪色的青绿背后，所燃烧的少年热血与大宋盛世的浩荡风华。\n\n展卷那一刻，千山激荡，万水奔流。这不仅是一幅画作，更是中华民族对大好河山最深情、最壮丽的视觉图腾。', 'http://localhost:8080/files/e7ff4d7f-d041-4a5c-9ece-e92ed8127f01.png', 0, '1库房', '河北博物馆', '1库房', '2026-02-23 15:17:00');
INSERT INTO `artifact` VALUES (6, '唐三彩贴花马', '佚名', '瓷器', '唐代', '大唐风骨跃泥胎，极彩流光自盛世。\n\n这是一匹从一千多年前的长安城中，迎着驼铃与西风，长啸而来的大唐骏马。\n\n从工艺科普的视角来看，唐三彩并非只有三种颜色，而是一种低温铅釉陶器。它以高岭土为胎，用含铜、铁、锰等元素的矿物做着色剂，在800度左右的窑火中烧制。最绝妙的是它的“流釉”工艺——在高温下，黄、绿、白（或褐、蓝）等各色釉料自然熔融、交织流淌，形成了斑斓绚丽、变幻莫测的斑驳色彩，每一匹都独一无二。\n\n画面中的三彩马，骨骼健壮，肌肉丰满，双耳如裁竹，双眸炯炯有神，那一低头或一扬蹄的姿态，将西域汗血宝马的雄浑野性与大唐匠人炉火纯青的雕塑功底展现得淋漓尽致。\n\n它身上的斑斓釉色，不仅是泥与火的艺术，更是那个包容万国、自信张扬的盛唐气象，在时光深处留下的最绚丽、最骄傲的侧影。', 'http://localhost:8080/files/2875158f-17e6-4eb5-ae4d-c14f84411354.png', 0, '3库房', '河北博物馆', '河北博物馆', NULL);
INSERT INTO `artifact` VALUES (102, '后母戊鼎', '佚名', '青铜', '商代', '国之重器，礼乐之尊。\n作为现存商代青铜文化鼎盛时期的至高杰作，后母戊鼎以其雄浑磅礴的体量，被誉为“镇国之宝”。\n它历经三千余年风霜，鼎身盘踞着神秘威严的饕餮纹与夔龙纹，彰显着殷商王室祭祀天地、沟通神明的至高威权。四足定乾坤，双耳承天命。翻开这部沉重的青铜史诗，抚摸那斑驳的铜绿，我们触碰到的不仅是商代匠人炉火纯青的铸造奇迹，更是中华文明绵延不绝、厚重如山的文化根基。', 'http://localhost:8080/files/16b65d0a-d0a4-4110-94df-824c391b72cd.png', 1, '珍宝馆A区', '广东省博物馆', '河北博物馆东馆二楼', '2026-04-12 21:07:14');
INSERT INTO `artifact` VALUES (103, '汝窑天青釉洗', '佚名', '瓷器', '北宋', '汝窑天青釉洗，承载了宋徽宗梦境中最极致的中式美学。\n釉如凝脂，天青犹翠；器形大巧若拙，简素明净。抚之如绢，望之如玉。\n那细密莹澈的蝉翼纹开片，是时光在素肌上留下的诗意痕迹；底部的芝麻细小支钉，更是巧夺天工的传世印证。它不事雕琢，却以一抹似蓝非蓝、似绿非绿的天青，将千年前宋人的禅意哲思与极简美学，定格为万古不朽的传奇。', 'http://localhost:8080/files/85ef3b7e-c287-4c99-b9c7-d8299fee8fc7.png', 0, '陶瓷馆', '广东省博物馆', '陶瓷馆', '2026-04-12 21:07:14');
INSERT INTO `artifact` VALUES (104, '兰亭集序(神龙本)', '王羲之', '法书', '东晋', '羲之真迹已随昭陵长眠，唯有“神龙本”《兰亭集序》，让那场永和九年的暮春修禊，在纸墨间活了千载。\n它承载着大唐宫廷的最高机密，双钩填墨，细若游丝。\n翻开此卷，王羲之微醺时的遒媚飘逸跃然纸上：二十一个“之”字字字不同，如流云、如惊鸿、如惊雷。由于采用了破锋双钩，我们甚至能顺着那若隐若现的牵丝映带，触碰到冯承素等大唐摹工指尖的呼吸，看见千年前魏晋名士一觞一咏的狂放与悲悯。这不仅是一张摹本，它是唯一能让我们无限逼近王羲之灵魂的旷世神作。', 'http://localhost:8080/files/293bada6-c60e-44ba-b138-e11b543121e7.png', 1, '三号库房', '广东省博物馆', '广东博物馆A馆', '2026-04-12 21:07:14');
INSERT INTO `artifact` VALUES (105, '金缕玉衣', '佚名', '玉石器', '西汉', '金缕交织千秋梦，玉衣空锁万古魂。\n\n这是一件用生死执念编织而成的时光战甲——西汉金缕玉衣。\n\n从科普的微观视角来看，它是中国汉代顶级规格的丧葬礼服。整件玉衣由数千块天然和田玉片精雕细琢而成，四角钻孔，以纯金细丝（金缕）抽丝编缀，严丝合缝地包裹住逝者的躯体。在汉人“金玉在九窍，则死者为之不朽”的朴素哲学里，玉石承载着灵魂不灭、羽化登仙的期冀。\n\n然而，历史给出了最冷峻的回答：纵使金缕坚韧、美玉无瑕，内里的血肉之躯终究化作了历史的尘埃，唯留这件冰冷而绚烂的玉衣，独自在黑暗的墓室中对抗了千年的孤寂。\n\n抚摸这冰凉的玉面，我们看到的不仅是汉代手工业巅峰时期的惊世奇迹，更是一篇用金与玉写就的、关于人类对抗死亡与时间的浪漫史诗。', 'http://localhost:8080/files/2f9e6547-82cc-487b-8464-e0c6583ee41d.png', 0, '出土文物厅', '广东省博物馆', '河北省博物馆A栋文化展厅', '2026-04-12 21:07:14');
INSERT INTO `artifact` VALUES (130, '黑白画像', '赵晓璇', '绘画', '现代', '岁月入墨，风霜满面；寥寥数笔，尽得风流。\n\n这是一幅承载着东方生命智慧与岁月沉淀的古风水墨老人画像。\n\n从中国传统绘画的科普视角来看，这幅画作将水墨写意（或兼工带写）的技法发挥到了极致。艺术家摒弃了五彩斑斓的颜色，仅凭借“墨分五色”（浓、淡、焦、干、湿）的精妙变化，在宣纸上晕染出老人的神韵。干笔皴擦出额头如刀刻般的皱纹，那是岁月留下的年轮；浓墨点染出沉静如海的眼眸，那是洞察世事后的通透；而衣褶处的泼墨留白，则深得传统美学“计白当黑”的禅意，虚实相生，气韵生动。\n\n画中的老人，或许是隐逸山林的智者，又或许是历尽沧桑的农夫。他无需言语，那微微颔首的姿态、饱经风霜的轮廓，本身就是一部活着的历史。\n\n这不仅是一幅画像，更是一首无声的生命赞歌。水墨在宣纸上洇散的过程，正如光阴在生命里留下的痕迹——虽无声色犬马的喧嚣，却有着独属于东方的、厚重而高贵的纯粹。', 'http://localhost:8080/files/faa83d6c-65e7-4f39-b288-30a6912c04be.png', 0, '现代艺术馆B区', '河北博物馆', '现代艺术馆B区', NULL);
INSERT INTO `artifact` VALUES (131, '五四青年画卷', '张智广', '绘画', '现代', '百年风雷激荡，青春破浪迎来。\n\n这是一幅用现代艺术语言，重塑热血灵魂与觉醒年代的《五四青年画卷》。\n\n从现代绘画艺术的科普视角来看，这幅作品打破了传统历史画作的沉闷，巧妙融合了表现主义的强烈色彩与现代构成感的线条。画面多采用象征觉醒与激情的红、象征真理与希望的蓝，形成高饱合度的视觉对撞。画中青年的面部轮廓运用了硬朗、果断的现代几何切面设计，眼神坚毅，姿态昂扬。这种“写意与具象”的交织，不仅精准捕捉了百年前青年们“以青春之我，创建青春之国家”的无畏气魄，更赋予了画面极强的现代张力和时代感。\n\n长卷铺展，不是历史的简单复刻，而是青春精神的隔空共振。\n\n凝视这幅画卷，那挥舞的旗帜、呐喊的群像，仿佛化作了冲破黑暗的炽热火炬。它用最现代的笔触，向所有观者宣告：五四不是一个完成时，而是一个进行时——只要热血未冷，理想犹在，青年的脊梁，便永远是这个时代最壮丽的风景。', 'http://localhost:8080/files/097aa957-d678-46a8-b427-0a513107512e.png', 0, 'B馆', '广东省博物馆', 'B馆', NULL);
INSERT INTO `artifact` VALUES (133, '松风阁（摹本）', '黄庭坚', '法书', '北宋', '一笔松风拂旷野，千年铁骨驻人间。\n\n作为“宋四家”之一黄庭坚晚年的绝对代表作，《松风阁诗帖》（摹本）以其苍劲孤傲的笔墨，定格了中国书法史上最惊心动魄的文人风骨。\n\n从书法与复制工艺的科普视角来看，此摹本精确还原了黄庭坚独创的“长笔辐射”与“战笔”特征。字形中宫紧收，四周笔画如长枪大戟般极力向外伸展，纵横跌宕；在书写横画、直画时，线条伴随着特有的颤动（战笔），如同苍松在疾风中抗争的枝干。通过精细的现代或传统摹刻工艺，墨色的枯润燥湿、运笔的提按顿挫被纤毫毕现地保留下来，达到了“下真迹一等”的艺术效果。\n\n诗中所写的“松风阁”，不仅是依山而建的避暑之所，更是黄庭坚在命运沉浮中，聆听松涛、叩问生命的栖息地。\n\n虽然真迹远在天涯，但展读这卷摹本，那如长松傲雪的线条、如万壑松风的笔势依然扑面而来。它不仅是一门技艺的传承，更是每一位观者穿越时空，与那位倔强、高傲的宋代灵魂最深情的相遇。', 'http://localhost:8080/files/3df4340e-58b3-4680-ac86-d4c99099a0ff.png', 1, 'C库房2-1区', '上海博物馆', '广东博物馆A馆', NULL);
INSERT INTO `artifact` VALUES (134, '歌乐图卷', '佚名', '绘画', '南宋', 'http://googleusercontent.com/image_collection/image_retrieval/13926615024765792976_0为您奉上一段针对上海博物馆藏南宋佚名《歌乐图卷》的专属介绍词，融入了南宋特有的精致审美、服饰乐器科普与历史文化内涵：\n\n泥金褙子衬罗裙，八百年遥听宋音。\n\n这是一幅深藏于上海博物馆的南宋传世孤品——《歌乐图卷》，它将南宋宫廷教坊乐班排练演奏的唯美瞬间，定格在盈尺绢素之间。\n\n从历史与服饰乐器的科普视角来看，此卷堪称南宋社会文化生活的生动写照。全卷在背景上极简留白，仅以太湖石、廊栏和棕榈树营造出清幽的庭院。苑中十二位人物一字排开，其中九位南宋教坊女伎身姿修长，统一穿着当时最时髦的红色窄袖褙子，衣襟上绘有象征官方尊贵身份的泥金图案；她们头梳高髻，簪以独特的珠翠“团冠”。乐班手中所持的曲项琵琶、拍板、方响、排箫等乐器组合，严谨地复刻了宋代教坊的演乐制式。\n\n它的珍贵，在于“以画证史”。两宋时期瓦舍勾栏、听戏看曲之风盛行，但在传世南宋人物画中，唯独此卷以极其罕见的写实笔触，聚焦于歌乐女伎这一题材。\n\n展开这幅设色艳丽、用笔精细的画卷，那流畅的衣纹与专注的乐手交织。没有宏大的战争叙事，只有市井或宫廷深处最优雅的丝竹余音。它用这一抹流传了八百年的中国红，带我们重温了那个清雅、内敛却又极具审美张力的两宋时代。', 'http://localhost:8080/files/b5207eed-28c9-4d20-938c-8ef241d5aa1d.jpg', 0, '书画展厅', '上海博物馆', '书画展厅', NULL);
INSERT INTO `artifact` VALUES (135, '千字文卷', '赵佶', '法书', '北宋', '为您奉上一段兼具帝王才情、瘦金体书法科普、极致视觉美学与历史宿命感的赵佶（宋徽宗）《草书千字文》或《瘦金体千字文》介绍词（这里以他最震撼、最惊世骇俗的《草书千字文》为例，若您需要瘦金体版可随时告诉我）：\n\n狂草狂飙惊风雨，一笔写尽帝王孤。\n\n这是北宋艺术之王宋徽宗赵佶，在宣和四年写下的旷世神作——《草书千字文》。\n\n从书法工艺的科普视角来看，这幅长达十数米的巨幅长卷，堪称中国书法史上的炫技之作。赵佶打破了他标志性“瘦金体”的严谨规整，以极具爆发力的狂草一气呵成。笔势如惊雷奔马、飞瀑落九天，线条看似细若游丝，实则铁画银钩，内含惊人的风骨与劲道。更令人叹为观止的是它的载体——这是一张由宫廷特制的、长达十一米多且毫无拼接痕迹的“巨幅防风盐水笺”。画师在纸上用泥金描绘出暗隐的飞龙图案，赵佶在金龙墨海间挥洒纵横，真正做到了“字字腾飞，龙蛇游走”。\n\n它的震撼，在于“诸美共流”的极致浪漫。一千个字，无一字懈怠，无一笔重样。\n\n凝视这幅长卷，金色的龙纹在墨色下若隐若现，狂放的草书在纸上呼啸而过。这不仅是一场笔墨的狂欢，更是这位文艺帝王在北宋大厦将倾前，倾尽全国之力，用天才的灵感和最奢华的材质，为那个崇尚极致美学的时代写下的一首绚丽、决绝的告别诗。', 'http://localhost:8080/files/845a6813-8965-467b-8196-a938bd901290.jpg', 1, '东馆法书展厅', '上海博物馆', '广东博物馆A馆', NULL);
INSERT INTO `artifact` VALUES (136, '春秋楚王孙铜钟', '佚名', '青铜', '春秋', '铸于春秋时期，通高58.9厘米。主体呈合瓦形，器体下边为弧形。隧与鼓部饰有精美的蟠螭纹，篆、甬、舞部均饰窃曲纹。此钟最珍贵之处在于其钲部与左右鼓部皆刻有铭文，正背共六处，总计48字，记载了楚王孙的相关事迹，具有极高的历史研究与文字考证价值。', 'http://localhost:8080/files/53fcda69-8d69-4cc5-ad6a-46f09d4dbbbb.png', 1, '历史展厅/青铜器专柜', '广东省博物馆', '河北博物馆东馆二楼', '2026-05-25 18:20:42');
INSERT INTO `artifact` VALUES (137, '战国翼兽形铜盉', '佚名', '青铜', '战国', '战国时期的调酒或盛水器。该器物造型奇特且充满想象力，整体呈一只带有双翼的异兽形状。器身线条流畅，纹饰繁缛细腻，融实用性与高超的青铜造型艺术于一体，是反映战国时期青铜铸造工艺巅峰的代表作之一。', 'http://localhost:8080/files/94fe2e5c-c0dc-40f4-9401-3440b0a2335c.png', 1, '古代铜器展厅', '广东省博物馆', '河北博物馆东馆二楼', '2026-05-25 18:20:42');
INSERT INTO `artifact` VALUES (138, '东汉冷水冲型变形羽人纹四蛙乘骑像铜鼓', '佚名', '青铜', '东汉', '出土于两广地区，属于北方冷水冲型铜鼓。鼓面中心装饰有醒目的太阳纹，四周及鼓身布满变形羽人纹等细密纹饰。最核心的特征是鼓面边缘铸有四只栩栩如生的青蛙以及乘骑人物塑像，体现了岭南古代先民（西瓯、俚人等）的图腾崇拜、祭祀礼仪以及独特的稻作文化。', 'http://localhost:8080/files/90738a68-e426-416e-8747-f8d615123807.png', 1, '岭南历史与文化展厅', '广东省博物馆', '河北博物馆东馆二楼', '2026-05-25 18:20:42');
INSERT INTO `artifact` VALUES (139, '东周青铜人首柱形器', '佚名', '青铜', '东周', '广东本地考古发掘的代表性青铜器，多流行于粤北、粤东等地的先秦墓葬中。器物顶端铸有人首形状，面部特征带有浓郁的岭南土著民族（百越民族）的相貌特征。此类器物通常在底部设有插栓，是研究先秦时期岭南古国（如西瓯、南越前身）社会形态、兵器装备和族群面貌的独家物证。', 'http://localhost:8080/files/2854cbc1-2f3b-4e94-8b13-caf70139cd3b.png', 1, '岭南考古展厅', '广东省博物馆', '河北博物馆东馆二楼', '2026-05-25 18:20:42');
INSERT INTO `artifact` VALUES (140, '南宋陈容墨龙图轴', '陈容', '绘画', '南宋', '国家一级文物，是南宋画龙名家陈容传世的经典神作。画面中一条巨龙在狂风乌云、惊涛骇浪中破空而出，龙首威严，龙爪凌厉。全画纯用墨色，将水墨的浓淡干湿发挥到了极致，展现了极强的视觉冲击力与文人写意精神，历经近千年流传至今，弥足珍贵。', 'http://localhost:8080/files/8a117542-92e2-4f58-b66e-e70965df1cb8.png', 0, '历代绘画展厅/1号专柜', '广东省博物馆', NULL, '2026-05-25 18:22:27');
INSERT INTO `artifact` VALUES (141, '明颜宗湖山平远图卷', '颜宗', '绘画', '明代', '国家一级文物，被誉为“目前所见存世最早的广东本地画迹”。此画作于明正统时期，采用传统的三段式和平远构图，描绘了南方水乡山峦起伏、平沙万里、秋水浩渺的恬静风光。该作打破了岭南古代无大家画迹传世的记录，在中国绘画史和广东美术史上具有里程碑意义。', 'http://localhost:8080/files/7dfdfbbf-8468-48d6-bc27-ee5d51aedce1.png', 0, '广东历代绘画展厅', '广东省博物馆', NULL, '2026-05-25 18:22:27');
INSERT INTO `artifact` VALUES (142, '北宋无款群峰晴雪图轴', '佚名', '绘画', '北宋', '这是广东省博物馆馆藏绘画中时代最早的一幅艺术珍品。作品虽然没有作者落款，但深得北宋山水画“高远”与“深远”的精髓。画面描绘了冬日雪后群山初晴的宏伟景象，山石皴法严谨，气势雄浑，完美体现了北宋时期全景式山水画的崇高与静谧之美。', 'http://localhost:8080/files/15ee8aab-797a-4df4-b7f6-ad0d8169713d.png', 0, '宋元书画特展区', '广东省博物馆', NULL, '2026-05-25 18:22:27');
INSERT INTO `artifact` VALUES (143, '宋青白釉暗花缠枝牡丹纹大碗', '佚名', '瓷器', '宋代', '景德镇窑青白瓷的代表作。大碗造型端庄，胎质洁白细腻，釉色介于青白之间，莹润如玉。碗内壁刻划有流畅的缠枝牡丹纹饰，线条生动，深浅有致。在温润釉色的衬托下，若隐若现，尽显宋代素雅、内敛的极简美学。', 'http://localhost:8080/files/fdc8aa4f-3f50-4ad6-9b05-c7084cc41b12.png', 0, '历代陶瓷展厅/宋代瓷器区', '广东省博物馆', NULL, '2026-05-25 18:23:31');
INSERT INTO `artifact` VALUES (144, '清康熙青花大件山水人物纹瓷盘', '佚名', '瓷器', '清康熙', '清代康熙时期青花瓷的精品之作。此时期的青花以“墨分五色”著称，绘画工艺极高。盘面通过深浅不同的青色，勾勒出层峦叠嶂的山水景致与栩栩如生的人物故事，宛如一幅水墨山水画绢本平铺在瓷器之上，极具艺术观赏价值。', 'http://localhost:8080/files/e62b4a4b-86d2-4d45-b2ca-60e50afd7e99.png', 0, '明清陶瓷专展区', '广东省博物馆', NULL, '2026-05-25 18:23:31');
INSERT INTO `artifact` VALUES (145, '清乾隆广彩外销西洋人物图盘', '佚名', '瓷器', '清乾隆', '极具岭南本土与海上丝绸之路特色的“广彩”（广州织金彩瓷）外销瓷。瓷盘由景德镇烧制白胎，运至广州进行加彩烘烧。盘心绘有典型的西洋人物、庭院景观，四周饰以繁复的织金花卉纹。该器物是清代“一口通商”时期中西文化交融、贸易往来的重要实物见证。', 'http://localhost:8080/files/b3145775-75c9-4099-8b8c-8fd1a2a41abd.png', 0, '海上丝绸之路与外销瓷展厅', '广东省博物馆', NULL, '2026-05-25 18:23:31');
INSERT INTO `artifact` VALUES (146, '明万历青花象首耳大瓶', '佚名', '瓷器', '明代', '明代万历时期的典型大件陈设瓷。器形宏大，颈部两侧对称饰以象首形耳，寓意“太平有象”。瓶身通体以回青料描绘缠枝莲纹及吉祥图案，发色浓艳泛紫。由于晚明时期大件瓷器极易在窑中变形，此类保存完好且成色上佳的大瓶非常难得。', 'http://localhost:8080/files/cd1f6ae2-e3a2-4bc8-b3b5-df4f67ba5897.png', 0, '历代陶瓷展厅/明代瓷器区', '广东省博物馆', NULL, '2026-05-25 18:23:31');
INSERT INTO `artifact` VALUES (147, '西汉透雕龙凤纹重环玉佩', '佚名', '玉石器', '西汉', '出土于广州南越王墓，是南越国玉雕工艺的巅峰之作。玉佩分内外两重环，内环透雕一条游龙，外环透雕一只凤鸟，龙凤顾盼生姿。此器构图完美平衡，线条充满动感，是汉代玉器中不可多得的国宝级珍品。', 'http://localhost:8080/files/6691bde5-8626-4cc2-94c0-343d3ce447e3.png', 0, '历代玉器展厅', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (148, '清端石千岩竞秀砚', '佚名', '玉石器', '清代', '作为广东特产的“端砚”居中国四大名砚之首。此砚采用名贵的端州老坑石精雕而成，石质细腻如玉。砚身巧妙利用石眼与瑕疵，因材施艺，雕刻出千岩竞秀、层峦叠嶂的壮丽山水奇景，是文房雅玩中的极品。', 'http://localhost:8080/files/c699f2a6-88d4-4393-b326-799a722c6b60.png', 1, '广东端砚工艺特展区', '广东省博物馆', '上海博物馆西馆二楼西区', '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (149, '良渚文化玉璧', '佚名', '玉石器', '新石器时代', '征集自新石器时代良渚文化核心区域。玉璧呈暗绿色，质地厚重，中心对钻圆孔。表面保留了原始打磨的痕迹，素面无纹。作为古代祭天重器，它是研究我国史前玉文化与早期礼制社会的重要实物。', 'http://localhost:8080/files/d7b00a1c-33b0-4abe-ad0e-90cac237f886.png', 0, '古代玉器陈列室', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (150, '明代玉雕花鸟纹执壶', '佚名', '玉石器', '明代', '由上等和田白玉雕琢而成，壶身线条流畅。外壁采用浅浮雕工艺刻画江南花鸟图案，工艺细腻。明代玉器讲究“粗大明”，但此件器物却呈现出少有的规整与雅致，反映了明代中后期文人审美的流行。', 'http://localhost:8080/files/4ac4faf4-850f-4907-a090-f6e7b4b5830f.png', 0, '历代玉器展厅', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (151, '清代广绣百鸟朝凤图挂幅', '佚名', '织绣', '清代', '中国四大名绣之一“广绣”的传世佳作。画面以凤凰为中心，周边环绕着仙鹤、孔雀、鸳鸯等上百只形态各异的鸟类。广绣色彩浓艳、构图繁密，大量使用金银线刺绣，具有极强的立体感和极高的民间工艺价值。', 'http://localhost:8080/files/e6b266af-9e69-4723-b979-656eb1fdf9b8.png', 0, '岭南织绣与服饰展厅', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (152, '明红地织金团花缎女褂', '佚名', '织绣', '明代', '明代高等级贵族妇女的节日盛装。以大红织金缎为面料，通体织有规整的团花图案。金线在红缎的衬托下熠熠生辉。由于丝织品极难保存，这件明代服饰至今仍色彩鲜艳、结构完整，在纺织史研究中极为罕见。', 'http://localhost:8080/files/9a77c2cc-391f-4c08-9d89-de252524d381.png', 2, '历代丝织品特藏库', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (153, '清潮绣金绒米白缎抽纱台布', '佚名', '织绣', '清末民初', '此件作品融合了潮绣（粤绣分支）的垫高绣技法与近代西方传入的抽纱工艺。图案多为岭南佳果与西洋花卉，中西合璧，具有鲜明的地方特色，是晚清时期广东外销织绣品畅销海内外的真实写照。', 'http://localhost:8080/files/32df4c13-ed01-4a3a-9ccb-a4aebb03d342.png', 0, '外销艺术品展厅', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (154, '明黄缎地刺绣花卉纹幔帐', '佚名', '织绣', '明代', '高档宫廷或大户人家床榻、厅堂使用的幔帐。黄缎底色高贵，采用丝线绣出四季花卉及蝴蝶，寓意“耋耄富贵”。针法灵活多变，线条流畅，展现了明代刺绣工艺的婉约与大气。', 'http://localhost:8080/files/f9e33535-e420-46f6-90f2-321e5c3bf158.png', 0, '岭南织绣与服饰展厅', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (155, '清乾隆铜胎画珐琅西洋人物双耳瓶', '佚名', '珐琅器', '清乾隆', '典型的“广珐琅”（广州制造的画珐琅精品）。该瓶在铜胎上敷白珐琅釉，再用色彩艳丽的珐琅料绘制西洋母子及乡村风景画，配以细致的缠枝花卉边饰。它是清代宫廷御用及外销的高级奢侈品。', 'http://localhost:8080/files/1dddd5c1-2258-4d98-8607-bd06ab26e99b.png', 0, '广珐琅特展区', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (156, '清中期掐丝珐琅缠枝莲纹出戟鼎', '内务府造办处', '珐琅器', '清中期', '北京宫廷造办处风格的“景泰蓝”重器。仿商周青铜鼎造型，四足出戟。通体以蓝色珐琅釉为地，填烧红、黄、绿、白等色珐琅料的缠枝莲纹。釉面光亮，镀金厚重，彰显了皇家的大气与威严。', 'http://localhost:8080/files/b6c5b04d-abc0-480c-8423-17afc782543b.png', 0, '明清工艺珍宝展厅', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (157, '清晚期錾胎珐琅八宝纹花盆', '佚名', '珐琅器', '清晚期', '采用复杂的錾胎珐琅工艺制作。先在厚铜胎上錾刻出佛教“八宝”图案的轮廓，然后在下凹处填施各色珐琅釉料，经烧制、磨光、镀金而成。纹饰线条粗犷有力，具有极强的立体效果。', 'http://localhost:8080/files/9d010e5b-e9b0-4056-9067-235818334253.png', 0, '明清工艺珍宝展厅', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (158, '清金漆木雕人物故事神龛', '佚名', '漆器', '清代', '国家一级文物，广东最具代表性的民间漆艺“潮州金漆木雕”的绝世之作。神龛通体黑漆垫底，运用通雕、浮雕等手法雕刻出密不透风的戏剧人物故事，最后通体贴金。金碧辉煌，繁复至极，将木雕与漆艺完美融合。', 'http://localhost:8080/files/3d5e820b-8e5d-4531-9eb5-33de6e959da3.png', 0, '广东潮州木雕展厅', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (159, '清剔红海马呛水纹多宝盒', '佚名', '漆器', '清代', '精美的雕漆（剔红）工艺品。在木胎上层层髹涂红漆达几十层甚至上百层，再在半干的漆层上雕刻出汹涌的波涛与飞奔的海马。漆色鲜红夺目，刀法圆润，线条极具力度感。', 'http://localhost:8080/files/c6388b31-7ba0-4cf4-86cf-f6df3a9b394b.png', 0, '明清漆器陈列区', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (160, '清黑漆描金山水故事图八方牌盒', '佚名', '漆器', '清代', '专为西方市场定制的外销漆器。八角形盒身髹黑漆，表面用金漆（描金）绘制中国传统的山水建筑及人物故事。这种黑漆描金家具及器物在18、19世纪的欧洲贵族阶层中引发了疯狂的“中国风”热潮。', 'http://localhost:8080/files/7f75612c-cc40-4ceb-a811-9b2cadd9e4a4.png', 0, '海上丝绸之路与外销艺术展厅', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (163, '元至正刻本《大方广佛华严经》', '佚名', '古籍文献', '元代', '馆藏珍稀的元代佛经善本。经书采用经折装，纸张坚韧，墨色如漆。虽然历经数百年，但版面文字依然清晰如初。元代中晚期官刻本佛经传世极少，该经书具有极高的版本学与佛教文化研究价值。', 'http://localhost:8080/files/cac3bb8a-8e95-4290-8f9a-6a17d5c2834c.png', 2, '宗教文献特展区', '广东省博物馆', NULL, '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (165, '清代外销银累丝鎏金烧蓝寿字纹香熏', '广州银匠', '珍宝', '清代', '清代广州外销银器的巅峰代表作。香熏通体采用细如发丝的纯银丝编织（累丝）而成，表面鎏金并运用了独特的“烧蓝（珐琅）”工艺，呈现出迷人的蓝绿色彩。整件器物玲珑剔透，代表了当时中国银器制作的最高水平。', 'http://localhost:8080/files/6ac2a518-da07-4cea-9309-a115d0d24be7.png', 1, '外销奢侈品专展区', '广东省博物馆', '上海博物馆西馆二楼西区', '2026-05-25 18:26:19');
INSERT INTO `artifact` VALUES (167, '元解縉书大字诗轴', '解缙', '法书', '元末明初', '国家一级文物。明代内阁首辅、《永乐大典》总纂官解缙的狂草代表作。此轴书写气势磅礴，用笔跌宕起伏，线条流畅而极具张力，体现了解缙高超的草书造诣与狂放不羁的才子气质，是元末明初书法艺术的奇珍。', 'http://localhost:8080/files/261f19f3-0483-4d41-bd98-f6f9413e90ee.png', 0, '历代书法展厅/明清区', '广东省博物馆', NULL, '2026-05-25 18:27:19');
INSERT INTO `artifact` VALUES (168, '明董其昌行书临柳公权玄秘塔碑轴', '董其昌', '法书', '明代', '明代书画巨匠董其昌的行书晚年精品。此作虽为临摹唐代柳公权《玄秘塔碑》，但全以董氏自身标志性的“生拙秀润”笔意出之，不着意于形似，而得其神髓。布局章法疏朗，墨色燥润相兼，极具禅意。', 'http://localhost:8080/files/b3e93124-8d5f-4429-bea8-280f460bdfb0.jpg', 0, '历代书法展厅/明清区', '广东省博物馆', NULL, '2026-05-25 18:27:19');
INSERT INTO `artifact` VALUES (169, '明陈献章草书诗卷', '陈献章', '法书', '明代', '岭南大儒、江门学派创始人陈献章（白沙先生）的代表墨宝。陈白沙以发明“茅龙笔”（以广东新会圭峰山茅草制成的硬毫笔）闻名于世。此卷书法多用茅龙笔书写，笔锋苍劲生辣，飞白断续处如枯藤盘绕，形成了风靡全国、独树一帜的“白沙体”。', 'http://localhost:8080/files/18208cba-b37a-43fd-85f7-94030cd259f1.jpg', 0, '岭南历代书法展厅', '广东省博物馆', NULL, '2026-05-25 18:27:19');
INSERT INTO `artifact` VALUES (170, '清康熙御书“正大光明”匾额墨迹行书轴', '康熙帝', '法书', '清康熙', '清圣祖康熙皇帝（爱新觉罗·玄烨）的亲笔御书。康熙帝一生酷爱董其昌书法，此作结字规整，笔法圆劲，既有文人的清秀神韵，又兼具皇家独有的沉稳与威严气度，是研究清代帝王书法及宫廷文化的重要实物。', 'http://localhost:8080/files/70f83ed8-869a-4a04-b5ef-774e64f2ef4c.jpg', 0, '明清皇家艺术特展区', '广东省博物馆', NULL, '2026-05-25 18:27:19');
INSERT INTO `artifact` VALUES (171, '清邓石如篆书阴符经轴', '邓石如', '法书', '清代', '清代碑学巨贾邓石如的篆书代表作。该作结体严谨而舒展，用笔融入了隶书的笔意，打破了传统玉箸篆的死板。笔力雄厚，墨气淋漓，完美展现了清代中后期“以隶作篆”的碑派大印风格，对后世书坛影响深远。', 'http://localhost:8080/files/9f9cc560-dbdb-4bf6-929c-453d0d039c3a.png', 0, '历代书法展厅/碑学专区', '广东省博物馆', NULL, '2026-05-25 18:27:19');
INSERT INTO `artifact` VALUES (172, '西汉刘胜金缕玉衣', '佚名', '玉石器', '西汉', '国家首批禁止出国（境）展览文物，出土于满城汉墓。由2498片上等中山国玉片用金丝编缀而成。玉衣分头罩、上衣、裤筒、手套和鞋五部分，工艺精绝，是我国考古发掘中时代最早、保存最完整的金缕玉衣，彰显了汉代顶级的丧葬礼制。', 'http://localhost:8080/files/ce6fd9c1-7263-46a2-ad74-7f134fc37122.png', 0, '满城汉墓出土文物展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (173, '西汉窦绾透雕双龙衔环谷纹玉璧', '佚名', '玉石器', '西汉', '国家一级文物，出土于满城汉墓窦绾墓。玉璧通体透雕加战国延续的谷纹，上方透雕双龙戏珠衔环，线条极其流畅洗练。此璧玉质莹润，雕工玲珑剔透，代表了汉代玉器制作艺术的极高成就。', 'http://localhost:8080/files/22c3643a-e4f8-43db-bc91-9a1b395db36e.png', 0, '满城汉墓出土文物展厅', '河北博物馆', '', '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (174, '战国透雕双龙三凤纹玉佩', '佚名', '玉石器', '战国', '出土于河北平山三县中山国 。玉佩呈扁平状，采用精湛的透雕工艺刻画出双龙相互盘绕、三只凤鸟穿插其间的宏大构图。具有浓郁的北方中山国神秘、灵动的艺术风格。', 'http://localhost:8080/files/3fd83e3d-6aaf-47d3-8285-40538e871ec6.png', 0, '战国雄风-古中山国展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (175, '明代青玉镂雕松鹿纹笔筒', '佚名', '玉石器', '明代', '由整块青玉镂雕而成，筒身外壁雕刻有茂密的松林、奔跑的祥鹿以及灵芝等图案，寓意“松鹿同春、长寿富贵”。刀法深峻，层次分明，是明代文房玉器中的上乘之作。', 'http://localhost:8080/files/14d14f04-79f7-4b65-941f-f1fffa52bd60.png', 0, '馆藏历代玉器陈列', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (176, '明代红地缂丝云龙纹服饰残片', '佚名', '织绣', '明代', '采用了“一寸缂丝一寸金”的顶级缂丝工艺制作。在红色的丝底上，用各色丝线及金线缂织出五彩祥云与奔腾的巨龙。龙形威猛，缂工极为细致，是研究明代高等级宫廷织绣技术的重要标本。', 'http://localhost:8080/files/c2c5efb5-ce3a-4e07-9ef1-4c4dff95d025.png', 0, '纺织服饰陈列库', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (177, '清代刺绣八仙过海图条屏', '佚名', '织绣', '清代', '北方民间刺绣（北方多流行京绣、鲁绣风格）的代表作。采用高密度丝线，在缎面上绣出八仙各显神通跨越波涛的经典场景。色彩对比强烈，人物开脸生动，衣褶线条流畅。', 'http://localhost:8080/files/86ed7a46-4405-49f7-aa42-138a1e9a6261.png', 1, '民俗与民间艺术展厅', '河北博物馆', '上海博物馆西馆二楼西区', '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (178, '清光绪石青地平金绣蟒纹吉服袍', '佚名', '织绣', '清光绪', '清晚期北方高官或王室成员穿着的吉服。石青色缎地，通体运用“平金绣”技法绣制九条金蟒，间饰五彩祥云与下幅的八宝立水纹。绣工规整严谨，尽显晚清宫廷服饰的繁缛之美。', 'http://localhost:8080/files/3f6077a5-de10-4c31-885b-d7b9f35722f0.png', 0, '馆藏晚清服饰展', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (179, '清乾隆掐丝珐琅番莲纹双耳炉', '内务府造办处', '珐琅器', '清乾隆', '标准的清代宫廷景泰蓝。器表以经典的松石绿珐琅釉为地，填烧红、黄、紫等各色番莲纹。掐丝线条流畅而刚劲，镀金厚实明亮，带有鲜明的乾隆朝“造办处”工艺特征，极为富丽堂皇。', 'http://localhost:8080/files/a5b03705-4d57-4260-9780-fdd61c318ddb.png', 0, '明清工艺珍宝展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (180, '清中期画珐琅缠枝牡丹纹寿字赏瓶', '佚名', '珐琅器', '清中期', '铜胎画珐琅器。瓶身线条优雅，在外壁细腻的白釉地上用珐琅料彩绘繁复的缠枝牡丹纹，并在腹部核心位置写有规整的“寿”字。此瓶既有瓷器之秀美，又有金属珐琅之华贵。', 'http://localhost:8080/files/0c670ca8-9521-493c-9649-95514b36a30b.png', 0, '明清工艺珍宝展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (181, '清晚期掐丝珐琅多宝如意', '佚名', '珐琅器', '清晚期', '清代宫廷逢年过节或帝王祝寿时常见的陈设珍玩。如意通体以掐丝珐琅工艺装饰，首、中、尾三处镶嵌有吉庆纹饰，色彩斑斓，工艺繁复，具有极高的吉祥寓意与观赏价值。', 'http://localhost:8080/files/340bdef1-6cc1-48b9-b802-b3399dccd65d.png', 0, '明清工艺珍宝展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (182, '西汉扣银漆奁', '佚名', '漆器', '西汉', '出土于满城汉墓，是汉代上层贵族妇女使用的化妆盒。木胎，内外髹黑漆与红漆。其最大特色在于口沿和边缘处镶扣有精美的银边（即扣银工艺），不仅增加了器物的坚固度，更平添了一丝高贵。', 'http://localhost:8080/files/9afb06af-c5df-4239-9b49-da4f857f5f35.png', 0, '满城汉墓出土文物展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (183, '明代剔红高士登高图圆盒', '佚名', '漆器', '明代', '精美的剔红（雕漆）代表作。盒盖表面髹数十层红漆后，雕刻出高山、古松、流云以及一位文人登高远眺的场景。雕刻刀法利落，画面意境深远，体现了明代雕漆工艺的高超水平。', 'http://localhost:8080/files/0a8be4c2-4416-4448-8591-929bde0f7943.png', 0, '馆藏明清工艺品展', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (184, '清代黑漆螺钿山水亭台纹文具箱', '佚名', '漆器', '清代', '采用复杂的螺钿漆艺制作。通体髹黑漆，表面利用色彩斑斓的贝壳薄片（螺钿）拼嵌出细腻的江南山水、亭台楼阁和泛舟图景。在光线照射下，黑漆与螺钿交相辉映，流光溢彩。', 'http://localhost:8080/files/217a1bb1-61f3-4be0-a524-36c00f3104ff.png', 1, '馆藏明清工艺品展', '河北博物馆', '上海博物馆西馆二楼西区', '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (185, '元刻本《新刊大宋宣和遗事》', '佚名', '古籍文献', '元代', '院藏极其珍稀的元代刻本，属海内孤本或极其罕见的善本。该书记述了宋徽宗宣和年间的朝政及宋江三十六人起义等故事，是《水浒传》的重要蓝本之一。版刻字迹古朴，是研究中国小说史与元代印刷史的无上珍宝。', 'http://localhost:8080/files/6d9c5aff-51b1-4ced-a339-676c17f78a21.png', 0, '古籍善本特藏库', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (186, '明万历明内府刻本《大明会典》', '明官修', '古籍文献', '明万历', '明代万历年间的宫廷内府刻本。详细记载了明代从中央到地方的官制、礼仪、法律、军政等各项典章制度。纸张采用名贵的皮纸，印刷精美，装帧考究，是研究明代历史核心的官修文献。', 'http://localhost:8080/files/2d2a11c7-b337-4913-9508-8eff1ef71e09.png', 0, '古籍善本阅览室', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (187, '清代直隶总督署档案公文抄本', '直隶总督署官员', '古籍文献', '清代', '具有极高地方历史价值的直隶（今河北及周边地区）官方政治文献。内容涵盖了清代历任直隶总督（如李鸿章、曾国藩等）在任期间的奏折抄本、地方政务批复等，是研究清代直隶地区发展的独家档案。', 'http://localhost:8080/files/354cf160-e1e1-40b0-b496-54c92d813109.png', 0, '近现代与地方文献库', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (188, '战国错金银四龙四凤铜方案座', '佚名', '珍宝', '战国', '国家首批禁止出国（境）展览文物，出土于平山古中山国寿王墓。此方案座极为精巧复杂，底部由四只跪卧的梅花鹿承托，中间四龙四凤相互纠缠纠结，龙身凤翅通体错金银。打破了中原传统青铜器的呆板，是战国青铜与贵金属镶嵌工艺的极品。', 'http://localhost:8080/files/25bb8f87-bf8c-44ef-a392-d26d644a360b.png', 0, '战国雄风-古中山国展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (189, '西汉错金博山炉', '佚名', '珍宝', '西汉', '国家首批禁止出国（境）展览文物，出土于满城汉墓。炉身似海中仙山“博山”，通体运用极细的金丝错出神仙、奇兽与流云纹饰。香料点燃后，烟气从山峦间的孔洞中袅袅飘出，宛如仙境，是汉代浪漫主义与错金工艺的最高峰。', 'http://localhost:8080/files/8e98d085-c65e-459d-ba1c-278c74736dc5.png', 0, '满城汉墓出土文物展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (190, '战国错银双翼神兽', '佚名', '珍宝', '战国', '出土于古中山国遗址，是中山国独有的神话图腾怪物。神兽似狮似虎，背生双翼，作咆哮奔跑状。通体错银，饰以变形云纹，威武凶猛中带着一丝诡谲，极具北方游牧民族与中原文化碰撞的独特美感。', 'http://localhost:8080/files/7b08bf95-ee8b-4ab9-9f34-57a531465500.png', 0, '战国雄风-古中山国展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (191, '明张瑞图行草书五言诗轴', '张瑞图', '法书', '明代', '明末著名书家“晚明四大家”之一张瑞图的行草书代表作。张瑞图的书法以折带波臣、奇逸峻峭著称。此作章法紧凑，用笔多用侧锋、方笔，转折处如斩钉截铁，充满了强烈的节奏感与文人傲骨。', 'http://localhost:8080/files/58652a64-d202-4717-940f-0f7493bd0835.png', 0, '馆藏历代书法展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (192, '清刘墉行书临苏轼诗轴', '刘墉', '法书', '清代', '清代著名书家、“浓墨宰相”刘墉（刘罗锅）的行书精品。此轴临写苏东坡诗意，用墨极其浓厚，笔力内敛，体势丰腴。看似笨拙，实则骨力长存，深得“棉里裹铁”的刘氏书法精髓。', 'http://localhost:8080/files/bdec0869-1c90-4b47-b5ff-7a0cefaf2b28.png', 0, '馆藏历代书法展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (193, '清郑燮行草书竹石诗轴', '郑燮', '法书', '清代', '“扬州八怪”之一郑板桥的传世墨宝。此作采用了他独创的“六分半书”（将隶书、楷书、行草融入画竹之法）。字形歪歪斜斜却乱石铺街、错落有致，并配有他标志性的题画竹石诗，书画一体，极具个性。', 'http://localhost:8080/files/520051d9-e61e-40dc-8f48-4be06c5a3d9f.png', 0, '馆藏历代书法展厅', '河北博物馆', NULL, '2026-05-25 18:29:04');
INSERT INTO `artifact` VALUES (194, '晋顾恺之洛神赋图卷', '顾恺之(传)', '绘画', '东晋', '上博馆藏书画的镇馆之宝级别巨作。此卷虽为宋代摹本，但极为完美地保留了东晋顾恺之画风的神韵。画面根据曹植《洛神赋》创作，采用连环画式的构图，描绘了曹植与洛神真挚动人又怅惘分离的爱情故事，线条如“春蚕吐丝”，艺术价值极高。', 'http://localhost:8080/files/d0ff4c8a-f70c-433c-8576-5d541f252a85.jpg', 0, '中国历代绘画馆/1号特展柜', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (195, '唐孙位高逸图卷', '孙位', '绘画', '唐代', '国家一级文物，是唐代晚期画坛巨匠孙位唯一的传世真迹。画面描绘了魏晋时期“竹林七贤”中的山涛、王戎、刘伶、阮籍四位高士的闲适生活。人物神态刻画入木三分，衣褶孤高，是研究唐代人物画及魏晋名士风度的旷世孤本。', 'http://localhost:8080/files/83a4d101-7352-4346-aa0b-a5fbbb0d7608.jpg', 0, '中国历代绘画馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (196, '明沈周庐山高图轴', '沈周', '绘画', '明代', '“明四家”之首沈周为祝贺其老师陈宽七十大寿而创作的杰作。全图师法元代王蒙，用笔繁密，层峦叠嶂，气势雄浑，成功将庐山的崇高壮丽与对恩师的崇敬之情完美融合，是明代吴门画派全景式山水画的巅峰代表作。', 'http://localhost:8080/files/61177ea0-669b-4d92-ab04-dc62bb3817f8.jpg', 0, '吴门书画特展区', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (197, '清朱耷孤禽图轴', '朱耷(八大山人)', '绘画', '清代', '清代杰出写意大家八大山人的经典之作。画面极其精简，仅在白纸中央绘有一只单足独立、翻着白眼的孤鸟。整幅画作墨气淋漓，通过极度夸张和冷峻的造型，宣泄了作者作为明朝皇室后裔对清廷的不合作态度与内心的孤傲愤懑。', 'http://localhost:8080/files/2e47f0de-3f3d-482b-9ac1-e22ab8673bc3.jpg', 0, '中国历代绘画馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (198, '良渚文化神人兽面纹玉琮', '佚名', '玉石器', '新石器时代', '出土于太湖流域良渚文化核心遗址，是古代祭地的最高礼器。玉琮外方内圆，四角用极其细微的阴线錾刻出神人兽面纹徽章，工艺精密得令人叹为观止，是研究史前宗教崇拜、巫术与玉器切割工艺的核心物证。', 'http://localhost:8080/files/f56e2812-f17e-4203-9ed1-177adf36a555.jpg', 0, '中国古代玉器馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (199, '西汉透雕双龙纹玉璧', '佚名', '玉石器', '西汉', '上等和田青玉雕琢，璧身布满规整的蒲纹。两侧透雕有一对对称的游龙，龙身蜿蜒扭曲，极具汉代有雄浑、张扬的动态美。该璧出土时保存极好，玉质受沁后呈现出迷人的古玉光泽。', 'http://localhost:8080/files/61c2b1d6-37ce-436d-b9fa-3c9df9995cad.jpg', 0, '中国古代玉器馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (200, '清乾隆白玉桐荫仕女图两层珍玩', '内务府造办处', '玉石器', '清乾隆', '一件巧夺天工的“俏色”玉雕传奇。造办处玉工利用一块带有天然裂纹和黄色玉皮的和田白玉料，因材施艺，将其雕刻为一扇微开的红漆大门，门内一个仕女向外窥探，门外坐一仕女。巧妙将瑕疵化为江南桐荫庭院的绝妙景致。', 'http://localhost:8080/files/c38acfba-a0ed-4b91-b52e-e4095e0d9201.jpg', 0, '明清珍玩陈列区', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (201, '明代顾绣花鸟图册页', '韩希孟', '织绣', '明代', '上海本土诞生的非物质文化遗产“顾绣”（露香园顾氏家族刺绣）的极品。由明代针神韩希孟亲手刺绣。她“以针代笔，以线代墨”，将宋元名家花鸟画完美还原在丝绢之上，针法多变，晕色细腻，达到了“画绣一体”的最高艺术境界。', 'http://localhost:8080/files/809f343c-c4f8-47c7-96bc-17310a825f71.jpg', 0, '中国历代织绣馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (202, '清中晚期红地缂丝百子迎春图挂轴', '佚名', '织绣', '清代', '采用顶级通经断纬缂丝工艺。大红丝缎底色上缂织出上百个形态各异、正在燃放鞭炮、舞龙戏耍的童子形象。构图热闹繁密，色彩五彩缤纷，具有极高的节日喜庆色彩和晚清宫廷织绣工艺价值。', 'http://localhost:8080/files/eaf5be15-8841-41d4-8afe-8575ebf53a71.jpg', 1, '中国历代织绣馆', '上海博物馆', '上海博物馆西馆二楼西区', '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (203, '明黄色缎地刺绣十二章纹龙袍料', '明代官织', '织绣', '明代', '明代江南织造局为宫廷定制的龙袍未剪裁面料。黄色缎面上用纯金线和五彩丝线绣有正龙、行龙及古代帝王专用的“十二章纹”（日、月、星辰、山、龙等）。绣工严丝合缝，富丽堂皇。', 'http://localhost:8080/files/48ebfe96-7978-4dc2-bd5c-407fec0d1c66.jpg', 0, '织绣特藏库', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (204, '明景泰掐丝珐琅缠枝莲纹八宝大大盘', '御用监', '珐琅器', '明景泰', '带有着正宗明代官窑“景泰年制”款识的掐丝珐琅（景泰蓝）传世重器。盘心以极深的宝石蓝珐琅釉为地，中心掐丝绘制缠枝莲花，四周环绕佛教八宝纹。珐琅釉发色纯正，具有典型的明代金属胎珐琅的大气风格。', 'http://localhost:8080/files/bdc95322-1b22-4adc-bba7-f7a88b6325a0.jpg', 0, '中国明清工艺馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (205, '清乾隆画珐琅山水人物图方洗', '内务府造办处', '珐琅器', '清乾隆', '清代宫廷御用笔洗。四方形铜胎，内壁和外壁均敷有白色的珐琅釉，并由宫廷画师用细腻的笔触手绘出高士临流、远山如黛的中国传统山水画，工艺极其高雅精细。', 'http://localhost:8080/files/0b041156-94d6-4756-bc71-b0ad21262320.png', 0, '明清工艺珍宝展厅', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (206, '清中期錾胎珐琅拐子龙纹兽耳尊', '佚名', '珐琅器', '清中期', '仿商周青铜器造型，两侧饰以兽首耳。采用錾胎珐琅工艺，在凸起的青铜线条间填烧各色珐琅料。由于錾胎工艺比普通掐丝更费铜料和工时，此类器物具有极强的立体力量感，属于皇家陈设规格。', 'http://localhost:8080/files/9db0e4f7-9f6c-41c6-be6c-e4df1c7b59f0.jpg', 0, '中国明清工艺馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (207, '元代张成造剔红栀子花纹圆盘', '张成', '漆器', '元代', '国家一级文物。元代雕漆一代宗师张成的传世神作。盘内髹厚重红漆，雕刻一朵盛开的栀子花及含苞待放的花蕾，叶片翻卷舒展。刀法圆润流畅，毫无锋芒外露之感，盘底针刻“张成造”三字篆书款，是世界漆器史上里程碑式的珍宝。', 'http://localhost:8080/files/8f9f7f70-fa69-4caf-a5ac-fd9fccd251e5.jpg', 0, '中国历代漆器馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (208, '明宣德剔彩双龙戏珠纹大承盘', '漆作官窑', '漆器', '明宣德', '采用极为复杂的“剔彩”工艺（在胎体上分层髹涂红、绿、黄等不同颜色的漆层，雕刻时根据需要剔出不同漆层以显现色彩）。盘面描绘两条巨龙在云海中争夺火珠，色彩斑斓，层次分明，极具皇家威仪。', 'http://localhost:8080/files/317e2271-2ecc-4b9d-b7f0-977c6bb6c0a4.jpg', 0, '中国历代漆器馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (209, '清乾隆黑漆螺钿百寿图文具桌', '佚名', '漆器', '清乾隆', '一柄高等级清代宫廷漆器家具。桌身髹黑漆，桌面及四周边缘采用极其精细的薄螺钿工艺，拼嵌出一百个字体各异的“寿”字以及繁复的万字不到头花纹。黑漆之沉稳与螺钿之流光溢彩完美契合。', 'http://localhost:8080/files/ee638bcc-9034-420c-8e8d-47e1119ef078.jpg', 0, '明清家具陈列馆', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (211, '宋刻本《东坡乐府》', '苏轼', '古籍文献', '宋代', '院藏极其珍稀的宋代雕版印刷善本。收录了北宋大文豪苏东坡毕生创作的词作（乐府）。纸张坚韧，采用宋代经典的柳体或颜体字进行雕刻，版面舒朗尊贵。宋刻本在古籍界有“一页宋版一两黄金”之说。', 'http://localhost:8080/files/dde9b868-c3b6-4d47-8e7f-7447cc8abbc3.jpg', 0, '古籍善本阅览室', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (212, '明代顾氏露香园丛书木刻本', '顾清等撰', '古籍文献', '明代', '明代上海本地文化名门“露香园顾氏”私人刻印的丛书。该书校勘极精，字体清秀，代表了明代江南地区私人刻书、藏书文化的最高学术及工艺水平，对于研究明代江南社会文化和印刷史有极高价值。', 'http://localhost:8080/files/45f13b60-f480-4684-8b0a-e92bcb60b065.png', 0, '上海地方文献陈列室', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (213, '清金累丝镶嵌五蝠捧寿九珠凤冠', '内务府造办处', '珍宝', '清代', '清代高等级王妃或一品诰命夫人新婚、盛典时佩戴的奢华凤冠。全冠采用纯金丝手工编织（累丝）出五只祥蝠与三只凤凰，凤凰背部及冠身镶嵌有九颗滚圆、光泽莹润的天然大珍珠，工艺极其繁复，华贵无双。', 'http://localhost:8080/files/ae75141e-09dd-4d3d-bcb9-3e6babcec518.jpg', 0, '明清工艺珍宝展厅', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (214, '清代点翠镶嵌红蓝宝石如意簪', '佚名', '珍宝', '清代', '慈禧太后时期风格的宫廷高级发饰。利用翠鸟背部亮丽的蓝色羽毛贴嵌在金质发簪底托上（点翠），历经百年依然呈现出迷人的翠蓝色光泽。簪首中心更镶嵌有高纯度的红宝石与蓝宝石，交相辉映，极尽奢靡。', 'http://localhost:8080/files/5c9a05d6-bc01-4e89-b420-b7b649cf3869.jpg', 1, '明清工艺珍宝展厅', '上海博物馆', '上海博物馆西馆二楼西区', '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (215, '明末项圣谟金笺纸本设色山水扇面珍玩', '项圣谟', '珍宝', '明末清初', '这是一件将高级艺术与贵金属材质完美结合的“案头珍玩”。折扇面采用纯金箔铺底（金笺纸），明末名家项圣谟在其上用细笔工笔设色绘制了江南隐逸山水图。由于金笺纸极难着墨着色，该作品历经岁月洗礼仍金光闪闪、画意盎然。', 'http://localhost:8080/files/78814472-9d0c-4402-ad28-4f5cd20885f3.jpg', 0, '历代珍玩特展区', '上海博物馆', NULL, '2026-05-25 18:33:42');
INSERT INTO `artifact` VALUES (216, '宋拓晋唐历代名家法帖（粤雅堂本）', '历代名家书, 宋代拓工', '碑帖', '宋代拓本', '国家一级文物。此本为宋代精拓的历代名家法帖真迹，后由岭南著名藏书家伍崇曜辑入《粤雅堂丛书》。拓本字迹清晰，保留了晋唐大书家如王羲之、献之、颜真卿等人的核心神韵，是岭南地区传世碑帖收藏中的泰斗之作。', 'http://localhost:8080/files/8843ab57-a02d-46c5-bcf3-d026e1fe213f.jpg', 0, '古籍善本与碑帖展厅', '广东省博物馆', NULL, '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (217, '明拓唐李邕书叶有道碑册', '李邕(书), 明代拓工', '碑帖', '明代拓本', '唐代大书法家李邕（李北海）撰文并书写的名碑明代拓本。李邕书法以“行书入碑”闻名，笔力遒劲。此明拓本原石后毁，故此本极好地还原了李氏行楷书体字形欹侧、骨气洞达的原始风貌，极为罕见。', 'http://localhost:8080/files/7a2f0ac7-b1b1-40ef-9c26-9c012010b309.jpg', 0, '历代书画陈列室', '广东省博物馆', NULL, '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (218, '清拓汉张迁碑册', '汉代无名氏书, 清代拓工', '碑帖', '清代拓本', '汉代名碑《张迁碑》的清中期精拓本。该碑是汉隶（隶书）臻于成熟鼎盛时期的代表作，字形方整多变，拙中带巧。清代碑学兴起后，此拓本成为岭南及全国书法家研习汉隶、寻根溯源的必备范本。', 'http://localhost:8080/files/4f2e625d-94c3-479b-86f8-d6dcd7faf1a0.jpg', 1, '古籍善本与碑帖展厅', '广东省博物馆', '上海博物馆西馆二楼西区', '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (219, '清康熙御制翻刻淳化阁帖册', '历代书家, 清宫廷拓工', '碑帖', '清康熙', '清代康熙皇帝下令以内府所藏宋代《淳化阁帖》为蓝本，命内廷工匠重新翻刻上石并精拓而成的内府赏赐本。黑底白字，墨色如漆，纸张采用高档宫廷夹江纸，带有浓郁的清代皇家书学正统风格。', 'http://localhost:8080/files/e7227f52-33a6-4e97-b5f4-759e383123b7.jpg', 0, '明清工艺陈列区', '广东省博物馆', NULL, '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (220, '北宋拓北魏始平公造像记册', '朱义章(书), 北宋拓工', '碑帖', '北宋拓本', '龙门二十品之首《始平公造像记》的北宋早期拓本。原石为北魏太和二十二年刻，是龙门造像记中唯一的阳刻（字形凸起）作品。北宋拓本字口毫无剥蚀，极好地展现了魏碑（北碑）方笔斩钉截铁、雄强浑厚的原始刀锋力道。', 'http://localhost:8080/files/9dbe2dac-3d3b-4c08-a1c5-ea9e7cc7aa2b.png', 0, '石刻计划与碑帖特展区', '河北博物馆', NULL, '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (221, '明拓唐颜真卿大唐中兴颂碑册', '颜真卿(书), 明代拓工', '碑帖', '明代拓本', '唐代著名书家颜真卿摩崖石刻《大唐中兴颂》的明代原石拓本。此碑字大如拳，颜体楷书在此作中达到了“端庄雄伟、气势磅礴”的巅峰。明拓本完整保留了原石未遭严重风化前的摩崖字口，是北方碑学研究的重器。', 'http://localhost:8080/files/eddcdbce-3ad1-4503-a5ae-1874f3cafad8.png', 0, '馆藏历代碑帖陈列', '河北博物馆', NULL, '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (222, '清拓汉封龙山颂碑册', '汉代无名氏书, 清代拓工', '碑帖', '清代拓本', '《封龙山颂》原石位于河北元氏县封龙山，是记录北方汉代祭祀山神的重要碑刻。清代中晚期著名书家发掘并精拓此本。该拓本完美呈现了该碑字形舒展、笔画劲挺中带有篆书笔意的独特汉隶风格，极具地方历史文献价值。', 'http://localhost:8080/files/b59c143b-922f-49ad-b65b-48a326a5b12d.png', 0, '河北地方石刻风貌展', '河北博物馆', NULL, '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (224, '北宋拓宋代翻刻王羲之十七帖（游相本）', '王羲之(书), 宋代拓工', '碑帖', '北宋拓本', '国家一级文物，上博碑帖收藏的镇馆之宝。此为南宋宰相游似当年收藏的“游相十本”之一。根据唐代弘文馆所藏王羲之草书信札精细刻石并于北宋初年拓印，纸墨极古，传世极为罕见，被历代书家奉为“阁帖之冠”。', 'http://localhost:8080/files/b4c98cf2-5abd-4464-a928-ce7048f65c5d.jpeg', 0, '中国历代书法馆/碑帖专柜', '上海博物馆', NULL, '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (225, '唐拓隋丁道护启法寺碑册（孤本）', '丁道护(书), 唐代拓工', '碑帖', '唐代拓本', '海内绝无仅有的“唐拓孤本”。原石为隋代著名书家丁道护所书，其书法承前启后，融合了魏碑的骨力与唐楷的法度。该唐拓本墨色淡雅，字迹清秀，由于原碑在唐代以后便告毁佚，此拓本便成了世间唯一的传世实物。', 'http://localhost:8080/files/728afc79-c7c7-431e-8f2b-c1c5d1c6c6fd.jpg', 0, '中国历代书法馆/碑帖专柜', '上海博物馆', NULL, '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (226, '宋拓唐柳公权神策军碑册', '柳公权(书), 宋代拓工', '碑帖', '宋代拓本', '晚唐大书家柳公权奉旨书写的楷书巅峰之作。原石刻于皇宫禁地，后毁。此宋拓本（通常为剪裱册页形式）极为珍贵，字口锋芒毕露，完美展现了柳体“棱角分明、骨力遒劲”的楷书神髓，是不可多得的国宝级碑帖。', 'http://localhost:8080/files/c3c6a2ce-dbab-4e9d-b068-0aece7b2cde5.jpg', 0, '碑帖善本特藏库', '上海博物馆', NULL, '2026-05-25 18:35:43');
INSERT INTO `artifact` VALUES (228, '宋拓唐欧阳询九成宫醴泉铭册', '欧阳询(书), 宋代拓工', '碑帖', '宋代拓本', '“天下第一正书”唐代欧阳询《九成宫醴泉铭》的宋代精拓本。欧体楷书以“法度严谨、险绝俊秀”冠绝天下。此宋拓本在历代藏家手中流传，保留了最初始的笔画粗细对比与险绝结构，是研究欧体书法的最高母本。', 'http://localhost:8080/files/6a0ab943-ab5f-472a-b31b-24b49a276a3a.jpg', 0, '中国历代书法馆/碑帖专柜', '上海博物馆', NULL, '2026-05-25 18:35:43');

-- ----------------------------
-- Table structure for artifact_loan_request
-- ----------------------------
DROP TABLE IF EXISTS `artifact_loan_request`;
CREATE TABLE `artifact_loan_request`  (
  `req_id` bigint NOT NULL AUTO_INCREMENT,
  `app_id` bigint NOT NULL COMMENT '关联的巡展申请ID',
  `artifact_id` bigint NOT NULL COMMENT '文物ID',
  `artifact_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '文物名称（冗余，方便查询）',
  `owner_museum` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文物所属博物馆',
  `status` tinyint NULL DEFAULT 0 COMMENT '0-待审批 1-已同意 2-已拒绝',
  `audit_remark` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '审批备注',
  `audit_time` datetime NULL DEFAULT NULL,
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  `is_finalized` tinyint NULL DEFAULT 0 COMMENT '是否已签发: 0-草稿 1-已签发',
  PRIMARY KEY (`req_id`) USING BTREE,
  INDEX `app_id`(`app_id` ASC) USING BTREE,
  INDEX `artifact_id`(`artifact_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 73 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '文物借用子申请表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of artifact_loan_request
-- ----------------------------
INSERT INTO `artifact_loan_request` VALUES (27, 35, 101, '千里江山图(局部)', '广东省博物馆', 0, NULL, NULL, '2026-05-04 14:17:41', 0);
INSERT INTO `artifact_loan_request` VALUES (28, 36, 131, '五四青年画卷', '广东省博物馆', 1, '批量同意', '2026-05-04 15:23:14', '2026-05-04 15:22:43', 1);
INSERT INTO `artifact_loan_request` VALUES (29, 36, 132, '测试文物', '广东省博物馆', 1, '批量同意', '2026-05-04 15:23:14', '2026-05-04 15:22:43', 1);
INSERT INTO `artifact_loan_request` VALUES (30, 36, 130, '黑白画像一枚', '河北博物馆', 1, '', '2026-05-04 15:23:33', '2026-05-04 15:22:43', 1);
INSERT INTO `artifact_loan_request` VALUES (37, 41, 131, '五四青年画卷', '广东博物馆', 0, NULL, NULL, '2026-05-16 15:32:37', 0);
INSERT INTO `artifact_loan_request` VALUES (38, 41, 130, '黑白画像', '河北博物馆', 0, NULL, NULL, '2026-05-16 15:32:37', 0);
INSERT INTO `artifact_loan_request` VALUES (39, 41, 134, '歌乐图卷', '上海博物馆', 0, NULL, NULL, '2026-05-16 15:32:37', 0);
INSERT INTO `artifact_loan_request` VALUES (40, 41, 4, '千里江山图（摹本）', '河北博物馆', 0, NULL, NULL, '2026-05-16 15:32:37', 0);
INSERT INTO `artifact_loan_request` VALUES (41, 42, 131, '五四青年画卷', '广东省博物馆', 0, NULL, NULL, '2026-05-16 15:40:00', 0);
INSERT INTO `artifact_loan_request` VALUES (47, 45, 1, '青花瓷瓶', '河北博物馆', 1, '', '2026-05-16 16:17:28', '2026-05-16 16:17:18', 1);
INSERT INTO `artifact_loan_request` VALUES (52, 50, 102, '后母戊鼎', '广东省博物馆', 1, '批量同意', '2026-05-25 19:47:10', '2026-05-25 19:43:38', 1);
INSERT INTO `artifact_loan_request` VALUES (53, 50, 136, '春秋楚王孙铜钟', '广东省博物馆', 1, '批量同意', '2026-05-25 19:47:10', '2026-05-25 19:43:38', 1);
INSERT INTO `artifact_loan_request` VALUES (54, 50, 137, '战国翼兽形铜盉', '广东省博物馆', 1, '批量同意', '2026-05-25 19:47:10', '2026-05-25 19:43:38', 1);
INSERT INTO `artifact_loan_request` VALUES (55, 50, 138, '东汉冷水冲型变形羽人纹四蛙乘骑像铜鼓', '广东省博物馆', 1, '批量同意', '2026-05-25 19:47:10', '2026-05-25 19:43:38', 1);
INSERT INTO `artifact_loan_request` VALUES (56, 50, 139, '东周青铜人首柱形器', '广东省博物馆', 1, '批量同意', '2026-05-25 19:47:10', '2026-05-25 19:43:38', 1);
INSERT INTO `artifact_loan_request` VALUES (57, 51, 104, '兰亭集序(神龙本)', '广东省博物馆', 1, '', '2026-05-25 20:09:21', '2026-05-25 20:08:32', 1);
INSERT INTO `artifact_loan_request` VALUES (58, 51, 133, '松风阁（摹本）', '上海博物馆', 1, '批量同意', '2026-05-25 20:08:44', '2026-05-25 20:08:32', 1);
INSERT INTO `artifact_loan_request` VALUES (59, 51, 135, '千字文卷', '上海博物馆', 1, '批量同意', '2026-05-25 20:08:44', '2026-05-25 20:08:32', 1);
INSERT INTO `artifact_loan_request` VALUES (60, 51, 167, '元解縉书大字诗轴', '广东省博物馆', 2, '签发时自动拒绝', '2026-05-25 20:10:04', '2026-05-25 20:08:32', 1);
INSERT INTO `artifact_loan_request` VALUES (61, 52, 148, '清端石千岩竞秀砚', '广东省博物馆', 1, '批量同意', '2026-05-25 21:26:08', '2026-05-25 21:21:16', 1);
INSERT INTO `artifact_loan_request` VALUES (62, 52, 177, '清代刺绣八仙过海图条屏', '河北博物馆', 1, '批量同意', '2026-05-25 21:22:44', '2026-05-25 21:21:16', 1);
INSERT INTO `artifact_loan_request` VALUES (63, 52, 184, '清代黑漆螺钿山水亭台纹文具箱', '河北博物馆', 1, '批量同意', '2026-05-25 21:22:44', '2026-05-25 21:21:16', 1);
INSERT INTO `artifact_loan_request` VALUES (64, 52, 218, '清拓汉张迁碑册', '广东省博物馆', 1, '批量同意', '2026-05-25 21:26:08', '2026-05-25 21:21:16', 1);
INSERT INTO `artifact_loan_request` VALUES (65, 52, 202, '清中晚期红地缂丝百子迎春图挂轴', '上海博物馆', 1, '批量同意', '2026-05-25 21:21:31', '2026-05-25 21:21:16', 1);
INSERT INTO `artifact_loan_request` VALUES (66, 52, 214, '清代点翠镶嵌红蓝宝石如意簪', '上海博物馆', 1, '批量同意', '2026-05-25 21:21:31', '2026-05-25 21:21:16', 1);
INSERT INTO `artifact_loan_request` VALUES (67, 52, 165, '清代外销银累丝鎏金烧蓝寿字纹香熏', '广东省博物馆', 1, '批量同意', '2026-05-25 21:26:08', '2026-05-25 21:21:16', 1);
INSERT INTO `artifact_loan_request` VALUES (71, 54, 1, '青花瓷瓶', '河北博物馆', 1, '', '2026-05-26 18:31:05', '2026-05-26 18:30:42', 1);
INSERT INTO `artifact_loan_request` VALUES (72, 54, 142, '北宋无款群峰晴雪图轴', '广东省博物馆', 2, '', '2026-05-26 18:31:10', '2026-05-26 18:30:42', 1);

-- ----------------------------
-- Table structure for banner
-- ----------------------------
DROP TABLE IF EXISTS `banner`;
CREATE TABLE `banner`  (
  `banner_id` bigint NOT NULL AUTO_INCREMENT,
  `image_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '图片URL',
  `link_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '跳转链接',
  `sort` int NULL DEFAULT 0 COMMENT '排序',
  `status` tinyint NULL DEFAULT 1 COMMENT '0-隐藏 1-显示',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`banner_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '首页Banner表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of banner
-- ----------------------------

-- ----------------------------
-- Table structure for exhibition_application
-- ----------------------------
DROP TABLE IF EXISTS `exhibition_application`;
CREATE TABLE `exhibition_application`  (
  `app_id` bigint NOT NULL AUTO_INCREMENT COMMENT '申请ID',
  `applicant_id` bigint NOT NULL COMMENT '申请人ID(关联sys_user)',
  `title` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '巡展主题',
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '巡展方案描述',
  `target_location` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '巡展地点',
  `start_date` date NULL DEFAULT NULL COMMENT '预计开始日期',
  `end_date` date NULL DEFAULT NULL COMMENT '预计结束日期',
  `artifact_ids` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '申请借用的文物ID集合(逗号分隔或关联中间表)',
  `status` tinyint NULL DEFAULT 0 COMMENT '审批状态: 0-待审批, 1-已通过, 2-已驳回',
  `audit_remark` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '审批备注/驳回原因',
  `audit_time` datetime NULL DEFAULT NULL COMMENT '审批时间',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP COMMENT '提交时间',
  `time_slot_config` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT '{\"09:00-12:00\": 100, \"12:00-17:00\": 100}' COMMENT '场次名额配置',
  `ticket_price` decimal(10, 2) NULL DEFAULT 0.00 COMMENT '票价',
  `booking_notice` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '预约须知',
  `max_capacity` int NULL DEFAULT 0 COMMENT '每日人数上限',
  `cover_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '巡展封面图地址',
  `ticket_types` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL,
  PRIMARY KEY (`app_id`) USING BTREE,
  INDEX `applicant_id`(`applicant_id` ASC) USING BTREE,
  CONSTRAINT `exhibition_application_ibfk_1` FOREIGN KEY (`applicant_id`) REFERENCES `sys_user` (`user_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 55 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '巡展申请审批表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of exhibition_application
-- ----------------------------
INSERT INTO `exhibition_application` VALUES (50, 2, '【河北博物馆】青铜器展览', '绝无仅有的“国宝级”重器扎堆，国之重器密集度极高。', '河北博物馆东馆二楼', '2026-05-25', '2026-06-30', '102,136,137,138,139', 1, '策展方确认办展，系统自动通过', '2026-05-25 19:47:50', '2026-05-25 19:43:38', '[{\"name\":\"全天\",\"timeRange\":[\"09:00\",\"18:00\"],\"quota\":500}]', 0.00, '为你整理好了一份适用于河北博物馆（官方微信小程序、售票官网、或展厅入口公示牌）的游客须知与购票/退票守则。\n\n你可以直接将以下内容配置到你的系统前端或公告模块中：\n\n🏛️ 河北博物馆 · 观众入馆须知与票务守则\n一、 💡 观展注意事项\n实名预约入馆：所有观众（含免费及优惠对象）均需提前通过官方渠道进行实名预约，携带二代身份证原件或预约二维码刷闸机入馆。\n\n保持文明静谧：展厅内请勿大声喧哗、追逐打闹；请将手机调至静音或震动模式，以免影响他人观展。\n\n严禁拍照闪光：基于文物保护要求，全馆展厅内禁止使用闪光灯、三脚架和自拍杆。\n\n衣冠整洁入场：酗酒者、衣冠不整者（如穿拖鞋、赤膊等）以及携带宠物者谢绝入馆。\n\n幼童看护原则：行动不便的老年人、残疾人以及学龄前儿童，须由成年人陪同看护入馆。\n\n二、 🚫 禁止携带物品清单（严禁带入展厅）\n为保障文物安全与公共安全，以下物品禁止带入馆内：\n\n管制及危险物品：枪支弹药、管制刀具、易燃易爆品、剧毒及放射性物品。\n\n大件行李及工具：体积超过 40×40 厘米 的大件行李箱/包（请先至寄存处寄存）、各类滑板车、平衡车。\n\n液体与食品：易污染展厅环境的各类有色饮料、黏性食品、生鲜物品。\n\n专业摄录设备：未获馆方许可的专业航拍无人机、商业摄影轨道。\n\n三、 🎟️ 社会福利票（特惠票）购买专属资格\n⚠️ 郑重提示：社会福利票（特惠/免费票）为国家定向福利，仅限以下特定人群预约或购买。入馆时须由本人同时出示身份证和有效福利证件进行双重核验：\n\n军人及优抚对象：现役军人、残疾军人、退役军人、烈士遗属、因公牺牲军人遗属、病故军人遗属（凭军官证、文职干部证、士兵证或退役军人优待证）。\n\n老年人：年满 60周岁 及以上的老年人（凭二代身份证、老年人优待证）。\n\n残疾人：持有中国残疾人联合会颁发的残疾证、伤残国家机关工作人员证者（凭残疾证原件）。\n\n※ 不符合上述条件者若误购、冒购此类票种，现场核验不予通过，将无法入馆。\n\n四、 🔄 退票规则与说明\n线上自主退票：在未检票出行的前提下，观众最晚可在预约当天闭馆前（如16:30前）通过原购买渠道申请无条件全额退票。\n\n逾期不可退改：超过预约当天闭馆时间、或门票已被核销检票的，系统将自动锁单，一律不予退改、不予退款。\n\n爽约惩罚机制：如因个人原因无法到馆且未及时在线上取消预约，累计爽约达到一定次数（如 3 次）的账户，系统将在接下来的一段时间内（如 30 天内）限制其继续预约。\n\n原路退款时效：退款申请审核通过后，票款将在 1-5 个工作日内 自动原路退回至您的支付账户（微信/支付宝/银行卡）。', 500, 'http://localhost:8080/files/90621519-bcf1-43d8-b790-5bd00be323d6.png', '[{\"name\":\"成人票\",\"price\":30},{\"name\":\"学生票\",\"price\":20},{\"name\":\"社会福利票\",\"price\":0}]');
INSERT INTO `exhibition_application` VALUES (51, 8, '【广东博物馆】越海流徽：岭南历代法书墨迹展', '“越海”代指古百越与南海丝路，地理特征明显；“流徽”语出古诗文，意为流传下来的美德、诗文或艺术光彩。名字温润高雅。', '广东博物馆A馆', '2026-05-25', '2026-06-30', '104,133,135', 1, '策展方确认办展，系统自动通过', '2026-05-25 20:10:12', '2026-05-25 20:08:32', '[{\"name\":\"上午入场\",\"timeRange\":[\"09:00\",\"12:00\"],\"quota\":400},{\"name\":\"下午入场\",\"timeRange\":[\"13:00\",\"18:00\"],\"quota\":600}]', 0.00, '特价票预约与购票须知\n⚠️ 【严正提示】\n本馆社会福利票（特价/免票）属国家定向福利，仅限特定符合条件的人群预约及购买。\n为确保文物安全与入馆秩序，本馆实行**“实名预约+现场双重核验”**制。非符合条件人员请勿错购、冒购，否则现场核验不予通过将无法入馆。\n一、 专属购票与预约资格\n只有符合以下条件的观众，方可预约或购买社会福利票，入馆时须由本人出示二代身份证原件及对应的有效福利证件：\n老年人群\n资格条件：年满 60周岁 及以上的老年人。\n核验证件：本人二代身份证 或 老年人优待证原件。\n残疾人群\n资格条件：持有中国残疾人联合会颁发的残疾证，或伤残国家机关工作人员。\n核验证件：本人有效残疾证原件 或 伤残国家机关工作人员证原件。\n军人及优抚对象\n资格条件：现役军人、残疾军人、退役军人，以及烈士遗属、因公牺牲军人遗属、病故军人遗属。\n核验证件：本人军官证、文职干部证、士兵证、学员证或退役军人优待证原件。\n\n二、 现场核验与入馆流程\n实名比对：入馆时需在专设的“绿色通道/福利核验窗口”排队，由工作人员进行人脸、身份证及物理证件的三合一比对。\n\n证件有效性：所有福利证件必须在有效期内，涂改、过期、伪造或照片模糊不清的证件一律视为无效。\n\n禁止代刷：福利票限本人使用，严禁冒用、代刷他人证件。一经发现，馆方有权谢绝入馆并依法暂扣冒用证件。\n\n三、 退票与改签规则\n自主退票时限：在未检票入馆的前提下，如因行程变动，观众最晚可在预约当天闭馆前（如16:30前）通过原购买渠道申请线上全额退票。\n\n逾期锁单不退：超过预约当天闭馆时间，或门票已被现场扫描核销的，系统将自动锁单，一律不予退改、不予退款。\n\n爽约惩罚机制：若成功预约福利票后未到馆，且未在规定时间内取消，累计爽约满 3 次的账户，系统将自动触发限制机制，在接下来的 30天内 将无法再次预约本馆的任何门票。\n退款原路返回：线上申请退款成功后，系统将在 1-5 个工作日内 将票款原路退回至您的支付账户（微信/支付宝/银行卡）。', 1000, 'http://localhost:8080/files/e3f440de-924c-4efe-ab8a-a8c503e099b7.png', '[{\"name\":\"普通票\",\"price\":15},{\"name\":\"特价票（购买资格请看详情）\",\"price\":5}]');
INSERT INTO `exhibition_application` VALUES (52, 11, '【上海博物馆】繁华落尽，墨润浮生：清代文人生活展', '摒弃了宏大的政治叙事，将视角对准清代文人的内心世界与精致的日常生活。“案头清供”指书房里的玉雕、墨砚、文具，给人一种“结庐在人境，心远地自偏”的优雅与静谧。', '上海博物馆西馆二楼西区', '2026-05-25', '2026-06-30', '148,177,184,218,202,214,165', 1, '策展方确认办展，系统自动通过', '2026-05-25 21:26:37', '2026-05-25 21:21:16', '[{\"name\":\"上午入场\",\"timeRange\":[\"09:00\",\"12:00\"],\"quota\":400},{\"name\":\"下午入场\",\"timeRange\":[\"13:00\",\"18:00\"],\"quota\":600}]', 0.00, '【上海博物馆】“繁华落尽，墨润浮生：清代文人生活展”参观须知\n摒弃了宏大的政治叙事，本次展览将视角精准对准清代文人的内心世界与精致的日常生活。从书房里的玉雕、墨砚，到几案前的文具清供，无不传递着“结庐在人境，心远地自偏”的优雅与静谧。\n\n为了给您营造一个高雅、安静且秩序井然的观展环境，更好地体味清代文人的墨润浮生，请在购票及入馆前仔细阅读以下参观须知：\n\n一、 🎟️ 票务配置与预约说明\n本展览实行全员实名制分时段预约，观众需根据自身条件选择对应票种并合理安排场次：\n\n成人票：适用于普通成年观众。\n\n学生票 / 儿童票：适用于在校学生及未成年儿童，入场时需核验相关学生证件。\n\n老年票 / 社会福利票（特惠免票）：\n\n老年票：限60周岁及以上老年人预约。\n\n社会福利票：仅限现役军人、残疾军人、退役军人、残疾人等国家定向福利群体预约。\n\n⚠️ 特别提示：购买老年票与社会福利票的观众，入馆时须由本人同时出示二代身份证原件和对应的有效福利证件（如残疾证、军官证、退役军人优待证等）进行现场双重核验。非符合条件人员请勿错购，否则核验不予通过将无法入馆。\n\n二、 ⏰ 场次管理与入馆时限\n上午场：入馆及检票时间为 09:00 - 13:00（请在对应时段内刷闸机进馆，错开高峰）。\n\n下午场：入馆及检票时间为 13:00 - 17:00（每日17:00停止检票入馆）。\n\n请严格按照您预约的场次时间前来参观。因个人原因迟到或错过对应场次，当日门票将自动失效。\n\n三、 🚫 展厅内禁止携带物品及行为规范\n文人书房，重在静谧与雅致。为保护传世书画、漆器及玉石器等脆弱文物，请遵守以下规定：\n\n严禁拍照闪光：展厅内严禁使用闪光灯、三脚架及自拍杆。强光和金属支架极易对古代书画和漆器造成不可逆的物理损伤。\n\n禁止携带大件物品：体积超过 40×40 厘米的行李箱、背包，以及滑板车等工具请先至寄存处寄存。\n\n严禁携带食品饮料：请勿将有色饮料、黏性食品、生鲜及宠物带入展厅，共同维护展厅的清洁环境。\n\n保持展厅静谧：请将手机调至静音或震动模式。展厅内请勿大声喧哗、追逐打闹，以免惊扰清代文人的“案头清供”之美。\n\n四、 🔄 退票与爽约规则\n无忧退票时限：在未检票入馆的前提下，如行程有变，最晚可在预约当天闭馆前（16:30前）通过系统原渠道申请线上全额退票。\n\n逾期锁单不退：超过预约当天闭馆时间，或门票已被核销检票的，系统将自动锁单，一律不予退改。\n\n爽约惩罚机制：若成功预约门票（含免费福利票）后未到馆参观，且未在规定时间内取消，累计爽约满 3 次的账户，系统将自动限制其在接下来的 30天内 再次预约本站的任何展览门票。\n\n票款原路返回：退款申请审核通过后，票款将在 1-5 个工作日内原路退回至您的支付账户。\n\n提笔执墨，落暮皆情。 愿这场“繁华落尽，墨润浮生”的清代文人生活展，能让您在流连驻足间，读懂属于中国文人灵魂深处的浪漫与优雅。上海博物馆期待您的光临！', 500, 'http://localhost:8080/files/7900aed2-46d8-46b0-aaec-a0a6cd35777f.png', '[{\"name\":\"成人票\",\"price\":10},{\"name\":\"学生票\",\"price\":5},{\"name\":\"儿童票\",\"price\":0},{\"name\":\"社会福利票\",\"price\":0}]');
INSERT INTO `exhibition_application` VALUES (54, 2, '测试展览', '测试展览', '河北博物馆', '2026-05-26', '2026-05-31', '1', 1, '策展方确认办展，系统自动通过', '2026-05-26 18:31:28', '2026-05-26 18:30:42', '[{\"name\":\"全天\",\"timeRange\":[\"09:00\",\"18:00\"],\"quota\":500}]', 0.00, '请按时入场。', 500, 'http://localhost:8080/files/d2d07a10-6343-49d1-8f99-b64bc6485ab0.jpg', '[{\"name\":\"成人票\",\"price\":10},{\"name\":\"学生票\",\"price\":5}]');

-- ----------------------------
-- Table structure for exhibition_artifact_rel
-- ----------------------------
DROP TABLE IF EXISTS `exhibition_artifact_rel`;
CREATE TABLE `exhibition_artifact_rel`  (
  `rel_id` bigint NOT NULL AUTO_INCREMENT,
  `exhibition_id` bigint NOT NULL,
  `artifact_id` bigint NOT NULL,
  PRIMARY KEY (`rel_id`) USING BTREE,
  INDEX `exhibition_id`(`exhibition_id` ASC) USING BTREE,
  INDEX `artifact_id`(`artifact_id` ASC) USING BTREE,
  CONSTRAINT `exhibition_artifact_rel_ibfk_1` FOREIGN KEY (`exhibition_id`) REFERENCES `exhibition_plan` (`exhibition_id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `exhibition_artifact_rel_ibfk_2` FOREIGN KEY (`artifact_id`) REFERENCES `artifact` (`artifact_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 56 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '巡展与文物关联中间表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of exhibition_artifact_rel
-- ----------------------------
INSERT INTO `exhibition_artifact_rel` VALUES (38, 45, 102);
INSERT INTO `exhibition_artifact_rel` VALUES (39, 45, 136);
INSERT INTO `exhibition_artifact_rel` VALUES (40, 45, 137);
INSERT INTO `exhibition_artifact_rel` VALUES (41, 45, 138);
INSERT INTO `exhibition_artifact_rel` VALUES (42, 45, 139);
INSERT INTO `exhibition_artifact_rel` VALUES (43, 46, 104);
INSERT INTO `exhibition_artifact_rel` VALUES (44, 46, 133);
INSERT INTO `exhibition_artifact_rel` VALUES (45, 46, 135);
INSERT INTO `exhibition_artifact_rel` VALUES (46, 47, 148);
INSERT INTO `exhibition_artifact_rel` VALUES (47, 47, 177);
INSERT INTO `exhibition_artifact_rel` VALUES (48, 47, 184);
INSERT INTO `exhibition_artifact_rel` VALUES (49, 47, 218);
INSERT INTO `exhibition_artifact_rel` VALUES (50, 47, 202);
INSERT INTO `exhibition_artifact_rel` VALUES (51, 47, 214);
INSERT INTO `exhibition_artifact_rel` VALUES (52, 47, 165);
INSERT INTO `exhibition_artifact_rel` VALUES (55, 49, 1);

-- ----------------------------
-- Table structure for exhibition_plan
-- ----------------------------
DROP TABLE IF EXISTS `exhibition_plan`;
CREATE TABLE `exhibition_plan`  (
  `exhibition_id` bigint NOT NULL AUTO_INCREMENT COMMENT '巡展ID',
  `app_id` bigint NULL DEFAULT NULL COMMENT '来源申请ID',
  `title` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '巡展名称',
  `cover_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '宣传封面图',
  `location` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '巡展具体地点',
  `start_time` datetime NOT NULL COMMENT '开始时间',
  `end_time` datetime NOT NULL COMMENT '结束时间',
  `max_capacity` int NULL DEFAULT 100 COMMENT '每日最大预约人数',
  `current_status` tinyint NULL DEFAULT 0 COMMENT '巡展状态: 0-计划中, 1-进行中, 2-已结束',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '发布详情/公告内容',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  `time_slot_config` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT '{\"09:00-12:00\": 100, \"12:00-17:00\": 100}' COMMENT '场次名额配置',
  `ticket_price` decimal(10, 2) NULL DEFAULT 0.00 COMMENT '票价',
  `booking_notice` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '预约须知',
  `audit_remark` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '审批备注',
  `ticket_types` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL,
  `rich_content` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '富文本展览介绍',
  PRIMARY KEY (`exhibition_id`) USING BTREE,
  INDEX `app_id`(`app_id` ASC) USING BTREE,
  CONSTRAINT `exhibition_plan_ibfk_1` FOREIGN KEY (`app_id`) REFERENCES `exhibition_application` (`app_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 50 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '巡展计划发布表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of exhibition_plan
-- ----------------------------
INSERT INTO `exhibition_plan` VALUES (45, 50, '【河北博物馆】青铜器展览', 'http://localhost:8080/files/90621519-bcf1-43d8-b790-5bd00be323d6.png', '河北博物馆东馆二楼', '2026-05-25 09:00:00', '2026-06-30 18:00:00', 500, 1, '绝无仅有的“国宝级”重器扎堆，国之重器密集度极高。', '2026-05-25 19:47:50', '[{\"name\":\"全天\",\"timeRange\":[\"09:00\",\"18:00\"],\"quota\":500}]', 0.00, '为你整理好了一份适用于河北博物馆（官方微信小程序、售票官网、或展厅入口公示牌）的游客须知与购票/退票守则。\n\n你可以直接将以下内容配置到你的系统前端或公告模块中：\n\n🏛️ 河北博物馆 · 观众入馆须知与票务守则\n一、 💡 观展注意事项\n实名预约入馆：所有观众（含免费及优惠对象）均需提前通过官方渠道进行实名预约，携带二代身份证原件或预约二维码刷闸机入馆。\n\n保持文明静谧：展厅内请勿大声喧哗、追逐打闹；请将手机调至静音或震动模式，以免影响他人观展。\n\n严禁拍照闪光：基于文物保护要求，全馆展厅内禁止使用闪光灯、三脚架和自拍杆。\n\n衣冠整洁入场：酗酒者、衣冠不整者（如穿拖鞋、赤膊等）以及携带宠物者谢绝入馆。\n\n幼童看护原则：行动不便的老年人、残疾人以及学龄前儿童，须由成年人陪同看护入馆。\n\n二、 🚫 禁止携带物品清单（严禁带入展厅）\n为保障文物安全与公共安全，以下物品禁止带入馆内：\n\n管制及危险物品：枪支弹药、管制刀具、易燃易爆品、剧毒及放射性物品。\n\n大件行李及工具：体积超过 40×40 厘米 的大件行李箱/包（请先至寄存处寄存）、各类滑板车、平衡车。\n\n液体与食品：易污染展厅环境的各类有色饮料、黏性食品、生鲜物品。\n\n专业摄录设备：未获馆方许可的专业航拍无人机、商业摄影轨道。\n\n三、 🎟️ 社会福利票（特惠票）购买专属资格\n⚠️ 郑重提示：社会福利票（特惠/免费票）为国家定向福利，仅限以下特定人群预约或购买。入馆时须由本人同时出示身份证和有效福利证件进行双重核验：\n\n军人及优抚对象：现役军人、残疾军人、退役军人、烈士遗属、因公牺牲军人遗属、病故军人遗属（凭军官证、文职干部证、士兵证或退役军人优待证）。\n\n老年人：年满 60周岁 及以上的老年人（凭二代身份证、老年人优待证）。\n\n残疾人：持有中国残疾人联合会颁发的残疾证、伤残国家机关工作人员证者（凭残疾证原件）。\n\n※ 不符合上述条件者若误购、冒购此类票种，现场核验不予通过，将无法入馆。\n\n四、 🔄 退票规则与说明\n线上自主退票：在未检票出行的前提下，观众最晚可在预约当天闭馆前（如16:30前）通过原购买渠道申请无条件全额退票。\n\n逾期不可退改：超过预约当天闭馆时间、或门票已被核销检票的，系统将自动锁单，一律不予退改、不予退款。\n\n爽约惩罚机制：如因个人原因无法到馆且未及时在线上取消预约，累计爽约达到一定次数（如 3 次）的账户，系统将在接下来的一段时间内（如 30 天内）限制其继续预约。\n\n原路退款时效：退款申请审核通过后，票款将在 1-5 个工作日内 自动原路退回至您的支付账户（微信/支付宝/银行卡）。', NULL, NULL, '<h2 class=\"ql-align-center\"><strong>前言：铸鼎铭百越 —— 广东省博物馆馆藏青铜重器巡展</strong></h2><p>		青铜，是定格中华文明早期记忆的金色年华。当我们提起青铜器，脑海中往往会浮现出中原礼乐文明的厚重与肃穆。然而，在烟雨江南的另一端，古老的岭南大地同样在烈火与铜汁的交融中，激荡出独属于百越先民的传奇篇章。</p><p>		本次巡展由我馆与广东省博物馆联合举办，精心遴选了四件跨越春秋至东汉时期的岭南青铜瑰宝。这是一场跨越千里的文化赴约，更是一次中原礼乐风尚与百越浪漫图腾的跨时空对话。</p><p><br></p><p class=\"ql-align-center\"><strong><img src=\"http://localhost:8080/files/3d4cf879-ceab-4215-a3bb-62fd3998ec86.gif\"></strong></p><p class=\"ql-align-center\"><br></p><p class=\"ql-align-center\"><strong>将展览通过四个章节，为您揭开岭南青铜文明的神秘面纱</strong></p><p class=\"ql-align-center\"><br></p><p class=\"ql-align-center\"><br></p><h2 class=\"ql-align-center\"><strong style=\"color: rgb(102, 102, 0);\">「春秋楚王孙铜钟」</strong></h2><p class=\"ql-align-center\">这里有<strong>「春秋楚王孙铜钟」</strong>。它承载着中原楚文化的浸润，合瓦形的钟体与庄严的铭文交织，诉说着先秦时期南北文化在礼乐规制上的碰撞与双向奔赴。</p><p class=\"ql-align-center\"><br></p><h2 class=\"ql-align-center\"><strong style=\"color: rgb(102, 102, 0);\">「战国翼兽形铜盉」</strong></h2><p class=\"ql-align-center\">这里有<strong>「战国翼兽形铜盉」</strong>。奇幻流美的异兽双翼大展，线条流畅舒展，它将巧夺天工的造型艺术与实用的调酒功能完美融合，堪称楚风越韵工艺巅峰的代表之作。</p><p class=\"ql-align-center\"><br></p><h2 class=\"ql-align-center\"><strong style=\"color: rgb(102, 102, 0);\">「东周青铜人首柱形器」</strong></h2><p class=\"ql-align-center\">这里有<strong>「东周青铜人首柱形器」</strong>。作为岭南考古发掘的独家物证，顶端伫立的人首保留了古老百越民族独特的五官面貌，让两千多年前那群临江赶海、断发文身的先民形象，跨越历史长河，鲜活地跃然于观者眼前。</p><p class=\"ql-align-center\"><br></p><h2 class=\"ql-align-center\"><strong style=\"color: rgb(102, 102, 0);\">「东汉四蛙乘骑像铜鼓」</strong></h2><p>这里更有<strong>「东汉四蛙乘骑像铜鼓」</strong>。作为南方青铜文化的最高代表，鼓面边缘栩栩如生的青蛙与乘骑塑像，生动再现了百越先民祈求风调雨顺、稻作丰收的求雨祭祀场景，彰显着浓郁的图腾崇拜与独特的南方黑科技。</p><p><br></p><p><br></p><p>鼎铸岭南，墨绘百越。这批来自广东省博物馆的青铜重器，不仅打破了文物冰冷的玻璃罩，更用它们斑驳的锈迹与精绝的纹饰，向我们昭示着中华文明多元一体的宏大包容。提笔执墨，落暮皆情。让我们一同走进这片由青铜铸就的战国雄风与大汉幽州，去聆听那段激荡在南岭以南的远古回响。</p>');
INSERT INTO `exhibition_plan` VALUES (46, 51, '【广东博物馆】越海流徽：岭南历代法书墨迹展', 'http://localhost:8080/files/e3f440de-924c-4efe-ab8a-a8c503e099b7.png', '广东博物馆A馆', '2026-05-25 09:00:00', '2026-06-30 18:00:00', 1000, 1, '“越海”代指古百越与南海丝路，地理特征明显；“流徽”语出古诗文，意为流传下来的美德、诗文或艺术光彩。名字温润高雅。', '2026-05-25 20:10:12', '[{\"name\":\"上午入场\",\"timeRange\":[\"09:00\",\"12:00\"],\"quota\":400},{\"name\":\"下午入场\",\"timeRange\":[\"13:00\",\"18:00\"],\"quota\":600}]', 0.00, '特价票预约与购票须知\n⚠️ 【严正提示】\n本馆社会福利票（特价/免票）属国家定向福利，仅限特定符合条件的人群预约及购买。\n为确保文物安全与入馆秩序，本馆实行**“实名预约+现场双重核验”**制。非符合条件人员请勿错购、冒购，否则现场核验不予通过将无法入馆。\n一、 专属购票与预约资格\n只有符合以下条件的观众，方可预约或购买社会福利票，入馆时须由本人出示二代身份证原件及对应的有效福利证件：\n老年人群\n资格条件：年满 60周岁 及以上的老年人。\n核验证件：本人二代身份证 或 老年人优待证原件。\n残疾人群\n资格条件：持有中国残疾人联合会颁发的残疾证，或伤残国家机关工作人员。\n核验证件：本人有效残疾证原件 或 伤残国家机关工作人员证原件。\n军人及优抚对象\n资格条件：现役军人、残疾军人、退役军人，以及烈士遗属、因公牺牲军人遗属、病故军人遗属。\n核验证件：本人军官证、文职干部证、士兵证、学员证或退役军人优待证原件。\n\n二、 现场核验与入馆流程\n实名比对：入馆时需在专设的“绿色通道/福利核验窗口”排队，由工作人员进行人脸、身份证及物理证件的三合一比对。\n\n证件有效性：所有福利证件必须在有效期内，涂改、过期、伪造或照片模糊不清的证件一律视为无效。\n\n禁止代刷：福利票限本人使用，严禁冒用、代刷他人证件。一经发现，馆方有权谢绝入馆并依法暂扣冒用证件。\n\n三、 退票与改签规则\n自主退票时限：在未检票入馆的前提下，如因行程变动，观众最晚可在预约当天闭馆前（如16:30前）通过原购买渠道申请线上全额退票。\n\n逾期锁单不退：超过预约当天闭馆时间，或门票已被现场扫描核销的，系统将自动锁单，一律不予退改、不予退款。\n\n爽约惩罚机制：若成功预约福利票后未到馆，且未在规定时间内取消，累计爽约满 3 次的账户，系统将自动触发限制机制，在接下来的 30天内 将无法再次预约本馆的任何门票。\n退款原路返回：线上申请退款成功后，系统将在 1-5 个工作日内 将票款原路退回至您的支付账户（微信/支付宝/银行卡）。', NULL, NULL, '<h1 class=\"ql-align-center\"><strong style=\"color: rgb(0, 138, 0);\">越海流徽 —— 广东省博物馆与上海博物馆法书联合巡展</strong></h1><p><br></p><p>		翰墨千载，不过是墨汁落入宣纸时的一声轻叹；气象万千，皆定格于狼毫游走绢素时的提按顿挫。中国书法，从来不仅是线条的罗列，它是历代文人的铮铮风骨，是孤灯夜长时的自我剖白，更是生命在岁月激荡中留下的物化年轮。当纸墨相发，那些流传百代的笔尖微澜，便化作了打破时空界限的旷世绝响。</p><p>		本次巡展由我馆联合广东省博物馆与上海博物馆倾情奉献。展览以“传世·承袭·交融”为不竭之思，精心遴选了两大博物馆馆藏中最具分量、堪称中国书法史里程碑的三件法书瑰宝。这是一场跨越地域的文化交响，更是一次晋唐神韵与宋代尚意书风在方寸之间的巅峰对话。</p><p class=\"ql-align-center\"><img src=\"http://localhost:8080/files/de382230-54e3-45fc-a550-5e900b8c3e10.png\"></p><h4 class=\"ql-align-center\"><br></h4><h4 class=\"ql-align-center\"><a href=\"http://localhost:5173/user/relic-detail/104\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>【卷一·曲水流觞】 广东省博物馆藏 —— 《兰亭集序（神龙本）》</strong></a></h4><p class=\"ql-align-center\">那是东晋永和九年的暮春之初，会稽山阴的茂林修竹间，天朗气清，惠风和畅。书圣王羲之微醺提笔，一气呵成。本展展出的《兰亭集序（神龙本）》，虽为后世依真迹精摹之本，却因其带有神龙半印而名冠天下。它极其完美地保留了“天下第一行书”神妙飘逸、遒媚内敛的原始笔意。乾坤燥润、浓淡枯荣间，无一字不妥帖，无一笔不流美。那些深浅不一的墨痕，至今仍散发着魏晋名士放浪形骸、崇尚自然的绝代风流，是后世书者遥望中国行书源头的无上精神坐标。</p><p class=\"ql-align-center\"><img src=\"http://localhost:8080/files/c0e722b1-3516-4f60-bcb1-7182248c5ad7.png\"></p><h4 class=\"ql-align-center\"><br></h4><h4 class=\"ql-align-center\"><a href=\"http://localhost:5173/user/relic-detail/133\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>【卷二·险绝风骨】 上海博物馆藏 —— 《松风阁（摹本）》</strong></a></h4><p class=\"ql-align-center\">视线北上，掠过千山烟水，落笔处已是北宋文人的尚意江湖。原作乃北宋巨匠黄庭坚晚年寓居鄂州樊山松风阁时，听松涛阵阵、忆平生挚友而写下的行书绝笔。此本精摹本精准捕获了山谷道人“以画入书”的核心神髓。画面中字形中宫紧收、四面辐射，长笔纵横，如长枪大戟般极具奇崛之险。其线条沉雄郁拔，转折处如斩钉截铁，将北宋文人那种身处逆境却依然傲骨嶙峋、独步天下的精神世界，展现得淋漓尽致。</p><p class=\"ql-align-center\"><img src=\"http://localhost:8080/files/4da6d9c9-893a-4978-ba61-b48bbbda5314.png\"></p><h4 class=\"ql-align-center\"><br></h4><h4 class=\"ql-align-center\"><a href=\"http://localhost:5173/user/relic-detail/135\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>【卷三·文心雕墨】 上海博物馆藏 —— 北宋《千字文卷》</strong></a></h4><p class=\"ql-align-center\">天地玄黄，宇宙洪荒。同为上海博物馆珍藏的北宋《千字文卷》，则向我们展示了古典法度的极致之美。全卷上千字一气呵成，行笔如行云流水，结构严谨而气势连贯。它在法度中见飘逸，在规整中显灵动，每一个结字都仿佛经过千锤百炼，却又毫无人工雕琢的刻意。千字交织，墨气淋漓，这不仅是对华夏启蒙经典的至高致敬，更是宋代书者将古典主义美学推向极致的历史见证。</p><p class=\"ql-align-center\"><img src=\"http://localhost:8080/files/320ed2be-6232-4c42-9c98-fd3afebbf1ee.jpg\"></p><p class=\"ql-align-center\"><br></p><p class=\"ql-align-center\"><img src=\"http://localhost:8080/files/ec505591-396f-44cd-95b7-aa5500ac1dfa.png\"></p><p class=\"ql-align-center\"><br></p><p class=\"ql-align-center\">纸寿千年，墨润万物。这批跨越千里、在南粤大地集结亮相的传世法书真迹与精摹臻品，不仅打破了博物馆冰冷的玻璃罩，更用它们斑驳的绢素与遒劲的线条，向我们昭示着中华书法文明一脉相承、生生不息的血脉力量。</p><p class=\"ql-align-center\">提笔执墨，落暮皆情。在这座由翰墨铸就的纸上森林里，每一位观者都是时间的旅人。愿您在流连驻足间，能听懂那段回响在宣纸之上的远古心跳，读懂属于中国文人灵魂深处的浪漫与优雅。</p><p><br></p><h3 class=\"ql-align-center\"><strong>【广东博物馆宣发】越海流徽：岭南历代法书墨迹展周边领取指南</strong></h3><p>		翰墨飘香，流徽千年。广东省博物馆年度法书大展「越海流徽：岭南历代法书墨迹展」正在火热展出中！从陈白沙苍劲生辣的茅龙笔草书，到传世重器的晋唐墨迹神韵，一幅幅法书珍品让无数观众流连忘返。</p><p>为了让这份属于文人的浪漫与优雅走进大家的日常生活，馆方特别推出了本场展览的<strong>限定独家文创周边</strong>。如何将这些高颜值、充满书卷气的限定周边带回家？这份【周边领取指南】请务必收好！</p><p><br></p><h3><strong>✨ 一、 展览限定周边抢先看</strong></h3><ol><li><strong>【兰亭曲水】限定透卡</strong>：以展出法书的经典笔意为灵感，结合岭南山水设计的半透明书签透卡，阳光下折射出淡淡的墨香。</li><li><strong>【白沙遗风】茅龙贴纸</strong>：提取陈白沙标志性“茅龙体”狂草字迹，极具视觉冲击力，可贴于手帐本、电脑或手机壳上。</li><li><strong>【墨染五岭】定制帆布袋</strong>：大容量厚质帆布，正面印有展览主题“越海流徽”的专属大印与水墨泼墨山水图，文艺出街必备。</li></ol><p><br></p><h3><strong>🎁 二、 周边免费领取攻略（三选一或兼得）</strong></h3><h4><strong>攻略【1】—— 微信打卡有礼（可得：限定透卡）</strong></h4><ul><li><strong>参与方式</strong>：在展厅内寻找你最喜欢的一幅法书作品，拍照并分享至朋友圈。</li><li><strong>配文要求</strong>：带话题 <strong>#广东省博物馆越海流徽大展#</strong>，并附上一句你的观展心得。</li><li><strong>领取地点</strong>：三层历代书画展厅出口处的【文创服务台】。</li><li><strong>核验方式</strong>：向现场工作人员出示手机发布界面，即可现场兑换。</li></ul><h4><strong>攻略【2】—— 盖章集赞挑战（可得：茅龙贴纸）</strong></h4><ul><li><strong>参与方式</strong>：在展厅入口处免费领取“越海流徽”专用集章小册子，在展厅内的三个打卡点成功盖上本次展览的限定大印。</li><li><strong>领取地点</strong>：一层大堂【服务中心】。</li><li><strong>核验方式</strong>：出示集满三个印章的小册子即可兑换，同时你的小册子也可以带回家留作纪念。</li></ul><h4><strong>攻略【3】—— 现场互动问答（可得：定制帆布袋 · 每日限量）</strong></h4><ul><li><strong>参与方式</strong>：每日上午 10:00 及下午 15:00，展厅内将举办短暂的“法书小知识”现场互动，只要答对导览员提出的关于“兰亭集序”或“岭南书法”的趣味小问题，即可直接获得。</li><li><strong>领取地点</strong>：互动现场直接发放。</li></ul><p><img src=\"http://localhost:8080/files/f698764a-7417-4a51-9e52-dabd8a1649d2.png\"></p><h3><strong>⚠️ 三、 周边领取核心注意事项</strong></h3><ol><li><strong>实名核销原则</strong>：为让更多观众体验福利，每名观众凭当天有效的入馆预约码（二代身份证），每种周边<strong>限领一份</strong>，不可代领。</li><li><strong>数量有限，先到先得</strong>：所有限定周边均为本场展览专属定制，<strong>每日限量发放</strong>。如当日发放完毕，相关打卡活动将自动顺延至次日。</li><li><strong>特价票/社会福利票观众专享绿色通道</strong>：凡持有老年证、军官证、残疾证并购买/预约了社会福利票的观众，可在【文创服务台】直接免打卡领取【限定透卡】一张。</li><li><strong>保持展厅秩序</strong>：请在打卡拍照、排队领周边的过程中保持安静，切勿大声喧哗，听从现场工作人员的指引，共同维护高雅的观展环境。</li></ol><p><strong>提笔执墨，落暮皆情。</strong> 愿这些精致的周边能成为您本次广博之行的美好延伸。我们在展厅里，静候您的到来，一同读懂属于中国文人灵魂深处的优雅。</p>');
INSERT INTO `exhibition_plan` VALUES (47, 52, '【上海博物馆】繁华落尽，墨润浮生：清代文人生活展', 'http://localhost:8080/files/7900aed2-46d8-46b0-aaec-a0a6cd35777f.png', '上海博物馆西馆二楼西区', '2026-05-25 09:00:00', '2026-06-30 18:00:00', 500, 1, '摒弃了宏大的政治叙事，将视角对准清代文人的内心世界与精致的日常生活。“案头清供”指书房里的玉雕、墨砚、文具，给人一种“结庐在人境，心远地自偏”的优雅与静谧。', '2026-05-25 21:26:37', '[{\"name\":\"上午场次\",\"timeRange\":[\"09:00\",\"18:00\"],\"quota\":500},{\"name\":\"下午场次\",\"timeRange\":[\"09:00\",\"18:00\"],\"quota\":0},{\"name\":\"\",\"timeRange\":[\"09:00\",\"18:00\"],\"quota\":0}]', 0.00, '【上海博物馆】“繁华落尽，墨润浮生：清代文人生活展”参观须知\n摒弃了宏大的政治叙事，本次展览将视角精准对准清代文人的内心世界与精致的日常生活。从书房里的玉雕、墨砚，到几案前的文具清供，无不传递着“结庐在人境，心远地自偏”的优雅与静谧。\n\n为了给您营造一个高雅、安静且秩序井然的观展环境，更好地体味清代文人的墨润浮生，请在购票及入馆前仔细阅读以下参观须知：\n\n一、 🎟️ 票务配置与预约说明\n本展览实行全员实名制分时段预约，观众需根据自身条件选择对应票种并合理安排场次：\n\n成人票：适用于普通成年观众。\n\n学生票 / 儿童票：适用于在校学生及未成年儿童，入场时需核验相关学生证件。\n\n老年票 / 社会福利票（特惠免票）：\n\n老年票：限60周岁及以上老年人预约。\n\n社会福利票：仅限现役军人、残疾军人、退役军人、残疾人等国家定向福利群体预约。\n\n⚠️ 特别提示：购买老年票与社会福利票的观众，入馆时须由本人同时出示二代身份证原件和对应的有效福利证件（如残疾证、军官证、退役军人优待证等）进行现场双重核验。非符合条件人员请勿错购，否则核验不予通过将无法入馆。\n\n二、 ⏰ 场次管理与入馆时限\n上午场：入馆及检票时间为 09:00 - 13:00（请在对应时段内刷闸机进馆，错开高峰）。\n\n下午场：入馆及检票时间为 13:00 - 17:00（每日17:00停止检票入馆）。\n\n请严格按照您预约的场次时间前来参观。因个人原因迟到或错过对应场次，当日门票将自动失效。\n\n三、 🚫 展厅内禁止携带物品及行为规范\n文人书房，重在静谧与雅致。为保护传世书画、漆器及玉石器等脆弱文物，请遵守以下规定：\n\n严禁拍照闪光：展厅内严禁使用闪光灯、三脚架及自拍杆。强光和金属支架极易对古代书画和漆器造成不可逆的物理损伤。\n\n禁止携带大件物品：体积超过 40×40 厘米的行李箱、背包，以及滑板车等工具请先至寄存处寄存。\n\n严禁携带食品饮料：请勿将有色饮料、黏性食品、生鲜及宠物带入展厅，共同维护展厅的清洁环境。\n\n保持展厅静谧：请将手机调至静音或震动模式。展厅内请勿大声喧哗、追逐打闹，以免惊扰清代文人的“案头清供”之美。\n\n四、 🔄 退票与爽约规则\n无忧退票时限：在未检票入馆的前提下，如行程有变，最晚可在预约当天闭馆前（16:30前）通过系统原渠道申请线上全额退票。\n\n逾期锁单不退：超过预约当天闭馆时间，或门票已被核销检票的，系统将自动锁单，一律不予退改。\n\n爽约惩罚机制：若成功预约门票（含免费福利票）后未到馆参观，且未在规定时间内取消，累计爽约满 3 次的账户，系统将自动限制其在接下来的 30天内 再次预约本站的任何展览门票。\n\n票款原路返回：退款申请审核通过后，票款将在 1-5 个工作日内原路退回至您的支付账户。\n\n提笔执墨，落暮皆情。 愿这场“繁华落尽，墨润浮生”的清代文人生活展，能让您在流连驻足间，读懂属于中国文人灵魂深处的浪漫与优雅。上海博物馆期待您的光临！', NULL, NULL, '<h1 class=\"ql-align-center\"><strong style=\"color: rgb(178, 107, 0); background-color: rgb(255, 235, 204);\">横向美学重组：清代文人生活的“三重宿命”</strong></h1><p><br></p><h2 class=\"ql-align-center\"><strong style=\"color: rgb(0, 55, 0);\">第一重：繁华的枷锁 —— 簪缨与海市的世俗皮囊</strong></h2><p>		清代文人的底色，首先是世俗的、繁华的。在康乾盛世的晚期，手工业与海上贸易达到了中国古代的最高峰。文人们身处其中，他们的家庭与生活被一种极致的、甚至略带奢靡的物质审美所包裹。</p><p><img src=\"http://localhost:8080/files/a7471821-f0f6-4aa7-ba9a-94022c267af9.png\"></p><ul><li><strong>【上海博物馆 · 点翠镶嵌红蓝宝石如意簪】</strong>：它是文人家庭闺阁中最夺目的亮色。翠羽的幽蓝与宝石的火红交织，不仅是财富的彰显，更是江南世家对细节品质近乎偏执的考究。</li><li><strong>【河北博物馆 · 刺绣八仙过海图条屏】与【上海博物馆 · 红地缂丝百子迎春图挂轴】</strong>：这两件织物，一件带着北方燕赵大地的硬朗与神仙寄托，一件带着南方织造“通经断纬”的绵密与家族期盼。红底百子，八仙凌波，文人的厅堂被这种极其热闹、极其世俗的祥瑞之气填满。</li><li><strong>【广东省博物馆 · 外销银累丝寿字纹香熏】</strong>：当一缕异香从累丝缝隙中飘出，它曾跨越伶仃洋，见证了一口通商的十三行风云。这是文人生活在“全球化”海贸浪潮下的一个缩影——他们的肉身，被牢牢锁在这场中国古代手工业最后的饕餮盛宴里。</li><li><br></li></ul><h2 class=\"ql-align-center\"><strong style=\"color: rgb(0, 55, 0);\">第二重：墨润的避难所 —— 书斋里对抗风雨的微观世界</strong></h2><p>		然而，文字狱的酷烈与仕途的险恶，让这群敏锐的灵魂感到窒息。于是，他们把目光从宏大的朝堂，收缩进了一方小小的书斋。在“案头清供”的微观世界里，他们开始了一场精神的自救。</p><p><img src=\"http://localhost:8080/files/f6357738-6632-4042-b15d-ecd2f65dcae0.png\"></p><ul><li><strong>【河北博物馆 · 黑漆螺钿山水亭台纹文具箱】</strong>：黑漆如夜，螺钿如星。文人把一开一合的箱箧，当成自己收纳笔墨的方寸天地。外界风雨大作，书斋内唯有文具玲珑。他们在这里整理纸墨，其实是在收拾自己被世俗撞得细碎的心。</li><li><strong>【广东省博物馆 · 清端石千岩竞秀砚】</strong>：这是书斋里最核心的圣物。匠人随形施艺，在端石上雕琢出层峦叠嶂。文人在晨光中磨墨，手指触碰着那微凉的石质，砚上的“千岩竞秀”，不是远方的风景，而是他们无法在现实中实现的胸中丘壑。墨润笔端，他们在一砚一墨的清供中，守住了自己最后的清高与优雅。</li><li><br></li></ul><h2 class=\"ql-align-center\"><strong style=\"color: rgb(0, 55, 0);\">第三重：金石的自救 —— 在斑驳的古文字里寻找不朽</strong></h2><p>		当现实的繁华终将“落尽”，肉身必将腐朽，清代文人最终在历史的深处找到了他们的归宿——那就是金石碑学。他们不再迷恋当下的功名，转而向一千多年前的石头和青铜寻找生命的永恒。</p><p><img src=\"http://localhost:8080/files/8ec7ccb9-3572-4848-be22-b1aa14de0d1f.png\"></p><ul><li><strong>【上海博物馆 · 清拓汉张迁碑册】</strong>：汉隶的方整、厚重与拙朴，在这册拓本上留下了斑驳的墨痕。清代文人推崇碑学，他们借着微弱的油灯，一遍遍摹写着《张迁碑》那斩钉截铁的线条。在一生无数次的提按顿挫中，汉隶的法度转化为了他们的心理防御机制。繁华落尽，唯有这些刻在石头上、传于宣纸之上的文字，能够跨越生死，墨润浮生。</li></ul><p><br></p><p><br></p><h1>【繁华落尽 · 展览限定文创及周边雅集指南】</h1><p>		物质的繁华虽会落尽，但那些承载过文人灵魂的笔触与风骨，却能借由当代的设计重获新生。上海博物馆联合多方设计团队，将展厅中清代文人的精神世界，凝练为四款兼具日常实用与古典美学的限定文创。愿您在观展之余，亦能将这份“墨润浮生”的优雅带回日常生活。<img src=\"http://localhost:8080/files/640a519f-aebf-4d3b-8791-298d8711116e.png\"></p><h2>一、限定周边 · 免费领取攻略</h2><p>本板块周边为非卖品，需通过观展过程中的“文人体验”互动或特定票种福利获取。</p><h3>🦚 【笔底波澜】点翠美学 · 限定帆布袋</h3><ul><li><strong>美学蓝本</strong>：灵感源自上博馆藏《点翠镶嵌红蓝宝石如意簪》<strong>与河北博物馆藏</strong>《刺绣八仙过海图条屏》。</li><li><strong>设计巧思</strong>：大容量的原色厚质帆布袋上，将点翠那抹夺目的幽蓝与刺绣的五彩丝线，以高精度的数码泼墨工艺晕染开来。世俗的极致繁华在布料上“落尽”为抽象的山水波澜，高级且富有张力，是文艺出街的绝佳单品。</li><li><strong>获取方式【数字裂变打卡】</strong>：</li><li class=\"ql-indent-1\"><strong>浮生共鸣</strong>：在展厅内任选一处让您感触最深的文玩（如端砚或文具箱），拍照并分享至个人社交平台。</li><li class=\"ql-indent-1\"><strong>配文要求</strong>：带话题 <strong>#上博清代文人生活展#</strong> 并附上您对“繁华落尽，墨润浮生”的一句随笔感悟。</li><li class=\"ql-indent-1\"><strong>核销地点</strong>：一楼大堂服务中心（每人凭当日有效预约入馆码限领一个，每日限额，先到先得）。</li><li><strong>【特定票种与绿色通道】</strong>：</li><li class=\"ql-indent-1\"><strong>福利专享</strong>：凡持老年证、军官证、残疾证并预约<strong>社会福利票 / 老年票</strong>的观众，可在入馆时于绿色通道核验处，直接凭本人有效证件免任务免费领取一个，数量有限，先到先得。</li></ul><h2>二、：限定文创 · 倾心选购指南（案头清供）</h2><p>本板块周边为上海博物馆官方文创旗舰店、线上商城同步发售的清代文人生活美学重器。</p><p><br></p><h3>🧢 【金石骨气】汉隶张迁碑 · 刺绣棒球帽</h3><ul><li><strong>美学蓝本</strong>：视觉解构上海博物馆藏《清拓汉张迁碑册》。</li><li><strong>设计巧思</strong>：放弃了死板的全文印制，设计师仅截取了《张迁碑》中方整雄强、极具现代骨骼感的标志性汉隶笔触，以沉稳的黑白两色丝线，立体刺绣于复古棉质棒球帽上。低调、硬朗，戴上它，是将千年金石的傲骨顶在头上。</li><li><strong>获取方式：</strong>上海博物馆一楼【官方文宣旗舰店】/ 本站商城</li></ul><p><br></p><h3>🧥 【浮生墨白】清代山水 · 浮雕印花文化衫</h3><ul><li><strong>美学蓝本</strong>：融合广东省博物馆藏《清·端石千岩竞秀砚》的墨堂意境。</li><li><strong>设计巧思</strong>：选用高克重重装纯棉面料，通体呈现深邃的墨黑色与宣纸的米白色。胸前采用发泡浮雕工艺，将端砚上那幅“千岩竞秀”的重峦叠嶂以微立体的方式还原。摸上去如同砚石的肌理，穿在身上，便是将胸中的丘壑与山水化为了当代的时尚战袍。</li><li><strong>选购地点</strong>：上海博物馆一楼【官方文宣旗舰店】/ 本站商城。</li></ul><p><br></p><h3>🖋️ 【书斋自救】黑漆螺钿 · 限量笔记本钢笔组合</h3><ul><li><strong>美学蓝本</strong>：1:1 视觉解构河北博物馆藏《清·黑漆螺钿山水亭台纹文具箱》。</li><li><strong>设计巧思</strong>：这是本场大展的终极工艺文创。</li><li class=\"ql-indent-1\"><strong>笔记本</strong>：封面采用特殊钢琴烤漆材质，黑漆如夜，并在其上运用贝壳纸拼嵌出极为精细的螺钿山水亭台纹饰；</li><li class=\"ql-indent-1\"><strong>钢笔</strong>：笔身同样点缀螺钿流光，搭配定制的定制金尖，阻尼感完美复刻宣纸书写体验。</li><li class=\"ql-indent-1\">笔墨纸砚，在一开一合的礼盒间，为您在当代的办公桌上，筑起一方用来对抗浮躁、整理心绪的“微观避难所”。</li><li><strong>选购地点</strong>：上海博物馆一楼【官方文宣旗舰店】/ 本站商城。</li></ul><p><br></p><p><br></p><h2>⚠️ <span style=\"color: rgb(230, 0, 0);\">三、观展与周边领取核心守则</span></h2><p>为保障文物安全与高雅的观展秩序，请所有前来领取/购买周边的观众务必遵守：</p><p><br></p><ol><li><strong>时段对应核销</strong>：周边领取严格与您的预约场次挂钩。上午场（09:00 - 13:00）预约观众请勿在下午场前来排队领取，系统无法跨场次读取预约码。</li><li><strong>严格证件比对</strong>：由于【金石棒球帽】属于社会福利票/老年票觀眾的直接免打卡福利，现场将严格执行“人脸+身份证+物理证件（如残疾证、军官证等）”三合一比对，严禁代刷、冒用他人证件。</li><li><strong>退票熔断机制</strong>：如您在未检票前申请了线上退票，您的周边预约资格将同步注销。所有限定周边均为每日限量发放，如遇当日库存熔断，相关线上打卡活动将自动顺延至次日。</li><li><strong>守序即是高雅</strong>：文人书斋，重在静谧。在打卡拍照、排队或购买文化衫、笔记本的过程中，请勿大声喧哗、争抢。请听从馆方工作人员的现场指引，将您的脚步，放轻在清代文人的墨润时光里。</li></ol><p><br></p><p><br></p>');
INSERT INTO `exhibition_plan` VALUES (49, 54, '测试展览', 'http://localhost:8080/files/d2d07a10-6343-49d1-8f99-b64bc6485ab0.jpg', '河北博物馆', '2026-05-26 09:00:00', '2026-05-31 18:00:00', 500, 1, '测试展览', '2026-05-26 18:31:28', '[{\"name\":\"全天\",\"timeRange\":[\"09:00\",\"18:00\"],\"quota\":500}]', 0.00, '请按时入场。', NULL, NULL, '<p><strong>测试展览。</strong></p>');

-- ----------------------------
-- Table structure for favorite
-- ----------------------------
DROP TABLE IF EXISTS `favorite`;
CREATE TABLE `favorite`  (
  `fav_id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL,
  `exhibition_id` bigint NOT NULL,
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`fav_id`) USING BTREE,
  UNIQUE INDEX `user_id`(`user_id` ASC, `exhibition_id` ASC) USING BTREE,
  INDEX `exhibition_id`(`exhibition_id` ASC) USING BTREE,
  CONSTRAINT `favorite_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `sys_user` (`user_id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `favorite_ibfk_2` FOREIGN KEY (`exhibition_id`) REFERENCES `exhibition_plan` (`exhibition_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 34 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '巡展收藏表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of favorite
-- ----------------------------
INSERT INTO `favorite` VALUES (31, 1, 45, '2026-05-25 19:57:39');
INSERT INTO `favorite` VALUES (32, 1, 46, '2026-05-25 20:27:25');

-- ----------------------------
-- Table structure for notice
-- ----------------------------
DROP TABLE IF EXISTS `notice`;
CREATE TABLE `notice`  (
  `notice_id` bigint NOT NULL AUTO_INCREMENT,
  `title` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `content` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `author_id` bigint NULL DEFAULT NULL COMMENT '发布管理员ID',
  `author_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT '管理员' COMMENT '发布者昵称',
  `notice_type` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT '系统公告' COMMENT '公告类型',
  `is_top` tinyint NULL DEFAULT 0 COMMENT '是否置顶: 0-否, 1-是',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`notice_id`) USING BTREE,
  INDEX `author_id`(`author_id` ASC) USING BTREE,
  CONSTRAINT `notice_ibfk_1` FOREIGN KEY (`author_id`) REFERENCES `sys_user` (`user_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 12 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '系统公告表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of notice
-- ----------------------------
INSERT INTO `notice` VALUES (8, '【河北博物馆周边文物上新】青铜器小模型，可爱上新，商城热销中！', '<h2 class=\"ql-align-center\">它们曾是庄重的礼器，在河北名窑与古墓中沉睡千年。如今，褪去岁月的肃穆，化身治愈系小模型灵动归来。 精细复刻每一道云雷纹饰，保留青铜的古拙，融入现代的可爱。 <strong>河北博物馆周边上新</strong>——不只是文创，更是触手可及的文明体温。 把“镇馆之宝”带回家，让桌面成为你的私人微缩博物馆。</h2><p class=\"ql-align-center\"><img src=\"http://localhost:8080/files/65f8e45f-d6d5-4bcf-99c2-b954081dbbcd.png\"></p><h3 class=\"ql-align-center\">谁说文物都是冷冰冰？河北博物馆青铜家族集体“成精”啦！ Q版比例 + 考究工艺，丑萌届的颜值天花板，摆在哪都是焦点。 ✅ 办公桌解压神器 ✅ 送礼不撞款的文化宝藏 ✅ 摄影摆拍的满分道具 <strong>商城热销中！</strong> 戳下方链接，开启你的“考古”寻宝之旅！</h3><p class=\"ql-align-center\"><br></p><p class=\"ql-align-center\"><br></p><p><br></p>', 3, '系统管理员', '活动通知', 0, '2026-05-06 01:04:25');
INSERT INTO `notice` VALUES (9, '大器同行，共纳山海 ', '<h3 class=\"ql-align-center\"><strong>大器同行，共纳山海 —— 期待您的博物馆光临入驻</strong></h3><p class=\"ql-align-center\"><br></p><p>		每一座博物馆，都是一处收藏文明碎片、封存时光心跳的宏伟殿堂。 从斑驳厚重的青铜礼乐，到流徽千载的法书墨迹，那些沉睡在展厅玻璃罩后的稀世珍宝，值得被世界以更无界、更灵动的方式看见。</p><p>为了搭建中原与岭南、古典与现代、文物与大众之间的数字桥梁，本站现面向全国各级博物馆、艺术馆及文化机构发出最诚挚的入驻邀请。</p><p>		在这里，我们不仅一同打破时空的边界，让文物在云端“活起来”；更将并肩执笔，为亿万线上的文化旅人，打造一座永不闭馆的数字博览森林。</p><p>提笔执墨，落暮皆情。我们怀揣对历史的敬畏，在此静候您的加入，一同开启华夏文明一脉相承、多元一体的数字新篇章！</p><p><br></p><h3 class=\"ql-align-center\"><strong>入驻专享权益抢先看</strong></h3><ol><li><strong>核心展讯全网宣发</strong>：尊享常设展、特展及交流巡展的专属头条推荐，直达百万博物馆爱好者。</li><li><strong>社会福利票高效预约</strong>：系统内置智能核销机制，支持老年人、残疾人及军人等特定人群的特惠/免票实名制预约与无忧退改。</li><li><strong>数字文创/周边裂变</strong>：轻松助力展厅限定周边与文创产品的火爆出圈。</li></ol><p><br></p><h3 class=\"ql-align-center\"><strong>馆际入驻联系方式</strong></h3><p>		如果您有入驻意向、展讯宣发或巡展合作需求，欢迎随时与我们取得联系。我们的工作人员将在 <strong>1-2 个工作日内</strong> 为您开通绿色通道并协助完成平台入驻：</p><ul><li><strong>官方入驻邮箱</strong>：museum_service@platform.com</li><li><strong>专属合作电话</strong>：020-1599-2888</li><li><strong>商务合作微信</strong>：museum_service2888</li><li><strong>入驻服务联络人</strong>：李经理 </li><li><strong>办公接洽地址</strong>：：北京市海淀区西二旗33号</li></ul><h3><br></h3><p><br></p><p><br></p>', 9, '站点管理员', '站点公告', 1, '2026-05-13 12:59:51');
INSERT INTO `notice` VALUES (10, '【广东博物馆宣发】越海流徽：岭南历代法书墨迹展周边领取指南', '<h3><strong>【广东博物馆宣发】越海流徽：岭南历代法书墨迹展周边领取指南</strong></h3><p>		翰墨飘香，流徽千年。广东省博物馆年度法书大展「越海流徽：岭南历代法书墨迹展」正在火热展出中！从陈白沙苍劲生辣的茅龙笔草书，到传世重器的晋唐墨迹神韵，一幅幅法书珍品让无数观众流连忘返。</p><p>为了让这份属于文人的浪漫与优雅走进大家的日常生活，馆方特别推出了本场展览的<strong>限定独家文创周边</strong>。如何将这些高颜值、充满书卷气的限定周边带回家？这份【周边领取指南】请务必收好！</p><p><br></p><h3><strong>✨ 一、 展览限定周边抢先看</strong></h3><ol><li><strong>【兰亭曲水】限定透卡</strong>：以展出法书的经典笔意为灵感，结合岭南山水设计的半透明书签透卡，阳光下折射出淡淡的墨香。</li><li><strong>【白沙遗风】茅龙贴纸</strong>：提取陈白沙标志性“茅龙体”狂草字迹，极具视觉冲击力，可贴于手帐本、电脑或手机壳上。</li><li><strong>【墨染五岭】定制帆布袋</strong>：大容量厚质帆布，正面印有展览主题“越海流徽”的专属大印与水墨泼墨山水图，文艺出街必备。</li></ol><p><br></p><h3><strong>🎁 二、 周边免费领取攻略（三选一或兼得）</strong></h3><h4><strong>攻略【1】—— 微信打卡有礼（可得：限定透卡）</strong></h4><ul><li><strong>参与方式</strong>：在展厅内寻找你最喜欢的一幅法书作品，拍照并分享至朋友圈。</li><li><strong>配文要求</strong>：带话题 <strong>#广东省博物馆越海流徽大展#</strong>，并附上一句你的观展心得。</li><li><strong>领取地点</strong>：三层历代书画展厅出口处的【文创服务台】。</li><li><strong>核验方式</strong>：向现场工作人员出示手机发布界面，即可现场兑换。</li></ul><h4><strong>攻略【2】—— 盖章集赞挑战（可得：茅龙贴纸）</strong></h4><ul><li><strong>参与方式</strong>：在展厅入口处免费领取“越海流徽”专用集章小册子，在展厅内的三个打卡点成功盖上本次展览的限定大印。</li><li><strong>领取地点</strong>：一层大堂【服务中心】。</li><li><strong>核验方式</strong>：出示集满三个印章的小册子即可兑换，同时你的小册子也可以带回家留作纪念。</li></ul><h4><strong>攻略【3】—— 现场互动问答（可得：定制帆布袋 · 每日限量）</strong></h4><ul><li><strong>参与方式</strong>：每日上午 10:00 及下午 15:00，展厅内将举办短暂的“法书小知识”现场互动，只要答对导览员提出的关于“兰亭集序”或“岭南书法”的趣味小问题，即可直接获得。</li><li><strong>领取地点</strong>：互动现场直接发放。</li></ul><p><img src=\"http://localhost:8080/files/f698764a-7417-4a51-9e52-dabd8a1649d2.png\"></p><h3><strong>⚠️ 三、 周边领取核心注意事项</strong></h3><ol><li><strong>实名核销原则</strong>：为让更多观众体验福利，每名观众凭当天有效的入馆预约码（二代身份证），每种周边<strong>限领一份</strong>，不可代领。</li><li><strong>数量有限，先到先得</strong>：所有限定周边均为本场展览专属定制，<strong>每日限量发放</strong>。如当日发放完毕，相关打卡活动将自动顺延至次日。</li><li><strong>特价票/社会福利票观众专享绿色通道</strong>：凡持有老年证、军官证、残疾证并购买/预约了社会福利票的观众，可在【文创服务台】直接免打卡领取【限定透卡】一张。</li><li><strong>保持展厅秩序</strong>：请在打卡拍照、排队领周边的过程中保持安静，切勿大声喧哗，听从现场工作人员的指引，共同维护高雅的观展环境。</li></ol><p><strong>提笔执墨，落暮皆情。</strong> 愿这些精致的周边能成为您本次广博之行的美好延伸。我们在展厅里，静候您的到来，一同读懂属于中国文人灵魂深处的优雅。</p>', 8, '广博策展人', '巡展资讯', 0, '2026-05-25 20:34:05');
INSERT INTO `notice` VALUES (11, '【上海博物馆宣发】繁华落尽 · 展览限定文创及周边雅集指南', '<h1>【繁华落尽 · 展览限定文创及周边雅集指南】</h1><p>		物质的繁华虽会落尽，但那些承载过文人灵魂的笔触与风骨，却能借由当代的设计重获新生。上海博物馆联合多方设计团队，将展厅中清代文人的精神世界，凝练为四款兼具日常实用与古典美学的限定文创。愿您在观展之余，亦能将这份“墨润浮生”的优雅带回日常生活。<img src=\"http://localhost:8080/files/640a519f-aebf-4d3b-8791-298d8711116e.png\"></p><h2>一、限定周边 · 免费领取攻略</h2><p>本板块周边为非卖品，需通过观展过程中的“文人体验”互动或特定票种福利获取。</p><h3>🦚 【笔底波澜】点翠美学 · 限定帆布袋</h3><ul><li><strong>美学蓝本</strong>：灵感源自上博馆藏《点翠镶嵌红蓝宝石如意簪》<strong>与河北博物馆藏</strong>《刺绣八仙过海图条屏》。</li><li><strong>设计巧思</strong>：大容量的原色厚质帆布袋上，将点翠那抹夺目的幽蓝与刺绣的五彩丝线，以高精度的数码泼墨工艺晕染开来。世俗的极致繁华在布料上“落尽”为抽象的山水波澜，高级且富有张力，是文艺出街的绝佳单品。</li><li><strong>获取方式【数字裂变打卡】</strong>：</li><li class=\"ql-indent-1\"><strong>浮生共鸣</strong>：在展厅内任选一处让您感触最深的文玩（如端砚或文具箱），拍照并分享至个人社交平台。</li><li class=\"ql-indent-1\"><strong>配文要求</strong>：带话题 <strong>#上博清代文人生活展#</strong> 并附上您对“繁华落尽，墨润浮生”的一句随笔感悟。</li><li class=\"ql-indent-1\"><strong>核销地点</strong>：一楼大堂服务中心（每人凭当日有效预约入馆码限领一个，每日限额，先到先得）。</li><li><strong>【特定票种与绿色通道】</strong>：</li><li class=\"ql-indent-1\"><strong>福利专享</strong>：凡持老年证、军官证、残疾证并预约<strong>社会福利票 / 老年票</strong>的观众，可在入馆时于绿色通道核验处，直接凭本人有效证件免任务免费领取一个，数量有限，先到先得。</li></ul><h2>二、：限定文创 · 倾心选购指南（案头清供）</h2><p>本板块周边为上海博物馆官方文创旗舰店、线上商城同步发售的清代文人生活美学重器。</p><p><br></p><h3>🧢 【金石骨气】汉隶张迁碑 · 刺绣棒球帽</h3><ul><li><strong>美学蓝本</strong>：视觉解构上海博物馆藏《清拓汉张迁碑册》。</li><li><strong>设计巧思</strong>：放弃了死板的全文印制，设计师仅截取了《张迁碑》中方整雄强、极具现代骨骼感的标志性汉隶笔触，以沉稳的黑白两色丝线，立体刺绣于复古棉质棒球帽上。低调、硬朗，戴上它，是将千年金石的傲骨顶在头上。</li><li><strong>获取方式：</strong>上海博物馆一楼【官方文宣旗舰店】/ 本站商城</li></ul><p><br></p><h3>🧥 【浮生墨白】清代山水 · 浮雕印花文化衫</h3><ul><li><strong>美学蓝本</strong>：融合广东省博物馆藏《清·端石千岩竞秀砚》的墨堂意境。</li><li><strong>设计巧思</strong>：选用高克重重装纯棉面料，通体呈现深邃的墨黑色与宣纸的米白色。胸前采用发泡浮雕工艺，将端砚上那幅“千岩竞秀”的重峦叠嶂以微立体的方式还原。摸上去如同砚石的肌理，穿在身上，便是将胸中的丘壑与山水化为了当代的时尚战袍。</li><li><strong>选购地点</strong>：上海博物馆一楼【官方文宣旗舰店】/ 本站商城。</li></ul><p><br></p><h3>🖋️ 【书斋自救】黑漆螺钿 · 限量笔记本钢笔组合</h3><ul><li><strong>美学蓝本</strong>：1:1 视觉解构河北博物馆藏《清·黑漆螺钿山水亭台纹文具箱》。</li><li><strong>设计巧思</strong>：这是本场大展的终极工艺文创。</li><li class=\"ql-indent-1\"><strong>笔记本</strong>：封面采用特殊钢琴烤漆材质，黑漆如夜，并在其上运用贝壳纸拼嵌出极为精细的螺钿山水亭台纹饰；</li><li class=\"ql-indent-1\"><strong>钢笔</strong>：笔身同样点缀螺钿流光，搭配定制的定制金尖，阻尼感完美复刻宣纸书写体验。</li><li class=\"ql-indent-1\">笔墨纸砚，在一开一合的礼盒间，为您在当代的办公桌上，筑起一方用来对抗浮躁、整理心绪的“微观避难所”。</li><li><strong>选购地点</strong>：上海博物馆一楼【官方文宣旗舰店】/ 本站商城。</li></ul><p><br></p><p><br></p><h2>⚠️ <span style=\"color: rgb(230, 0, 0);\">三、观展与周边领取核心守则</span></h2><p>为保障文物安全与高雅的观展秩序，请所有前来领取/购买周边的观众务必遵守：</p><p><br></p><ol><li><strong>时段对应核销</strong>：周边领取严格与您的预约场次挂钩。上午场（09:00 - 13:00）预约观众请勿在下午场前来排队领取，系统无法跨场次读取预约码。</li><li><strong>严格证件比对</strong>：由于【金石棒球帽】属于社会福利票/老年票觀眾的直接免打卡福利，现场将严格执行“人脸+身份证+物理证件（如残疾证、军官证等）”三合一比对，严禁代刷、冒用他人证件。</li><li><strong>退票熔断机制</strong>：如您在未检票前申请了线上退票，您的周边预约资格将同步注销。所有限定周边均为每日限量发放，如遇当日库存熔断，相关线上打卡活动将自动顺延至次日。</li><li><strong>守序即是高雅</strong>：文人书斋，重在静谧。在打卡拍照、排队或购买文化衫、笔记本的过程中，请勿大声喧哗、争抢。请听从馆方工作人员的现场指引，将您的脚步，放轻在清代文人的墨润时光里。</li></ol><p><br></p>', 11, '上海策展人', '巡展资讯', 0, '2026-05-25 21:49:40');

-- ----------------------------
-- Table structure for notice_type
-- ----------------------------
DROP TABLE IF EXISTS `notice_type`;
CREATE TABLE `notice_type`  (
  `type_id` bigint NOT NULL AUTO_INCREMENT,
  `type_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '类型名称',
  `sort` int NULL DEFAULT 0,
  PRIMARY KEY (`type_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '公告类型表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of notice_type
-- ----------------------------
INSERT INTO `notice_type` VALUES (5, '博物馆公告', 0);
INSERT INTO `notice_type` VALUES (6, '巡展资讯', 0);
INSERT INTO `notice_type` VALUES (7, '活动通知', 0);
INSERT INTO `notice_type` VALUES (8, '温馨提示', 0);
INSERT INTO `notice_type` VALUES (9, '站点公告', 0);

-- ----------------------------
-- Table structure for portal_banner
-- ----------------------------
DROP TABLE IF EXISTS `portal_banner`;
CREATE TABLE `portal_banner`  (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `image_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '图片地址',
  `title` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '标题文字',
  `sort` int NULL DEFAULT 0 COMMENT '排序（数字越小越靠前）',
  `status` tinyint NULL DEFAULT 1 COMMENT '0-隐藏 1-显示',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  `main_title` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '基于Vue3的文物巡展管理系统' COMMENT '大标题',
  `link_url` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '点击跳转路径',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '门户轮播图' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of portal_banner
-- ----------------------------
INSERT INTO `portal_banner` VALUES (1, 'http://localhost:8080/files/6d0060d0-1113-4e69-a1ae-c289d5620f6b.png', '文明尽在掌间', 1, 1, '2026-05-13 15:27:06', '基于Vue3的文物巡展管理系统', NULL);
INSERT INTO `portal_banner` VALUES (2, 'http://localhost:8080/files/fa456409-bc5c-4e41-bb5e-b0f7cdde167f.png', '文明尽在掌间', 0, 1, '2026-05-14 08:16:45', '基于Vue3的文物巡展管理系统', 'shop/detail?productId=3');
INSERT INTO `portal_banner` VALUES (3, 'http://localhost:8080/files/d5e27bac-20da-4fe2-91ae-3aa327d4d360.png', '于朱墙金瓦间，叩开历史之门；在毫端起落处，窥见古人风骨。', 0, 1, '2026-05-14 08:41:07', '《故宫翰墨》倾情奉献', 'http://localhost:5173/user/shop/detail?productId=3');

-- ----------------------------
-- Table structure for reservation
-- ----------------------------
DROP TABLE IF EXISTS `reservation`;
CREATE TABLE `reservation`  (
  `res_id` bigint NOT NULL AUTO_INCREMENT COMMENT '预约ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `real_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '预约人真实姓名',
  `id_card` varchar(18) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '证件号码',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '联系电话',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '联系邮箱',
  `exhibition_id` bigint NOT NULL COMMENT '巡展ID',
  `reserve_date` date NOT NULL COMMENT '预约参观日期',
  `status` tinyint NULL DEFAULT 0 COMMENT '预约状态: 0-已预约, 1-已核销/已参观, 2-已取消',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  `time_slot` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT '09:00-12:00' COMMENT '参观时段(如:上午场, 14:00-16:00)',
  `ticket_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT '成人票' COMMENT '票种:成人,儿童,学生,老人,福利,其他',
  `verify_code` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '核销唯一加密串',
  `remark` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '用户备注',
  PRIMARY KEY (`res_id`) USING BTREE,
  UNIQUE INDEX `verify_code`(`verify_code` ASC) USING BTREE,
  INDEX `user_id`(`user_id` ASC) USING BTREE,
  INDEX `exhibition_id`(`exhibition_id` ASC) USING BTREE,
  CONSTRAINT `reservation_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `sys_user` (`user_id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `reservation_ibfk_2` FOREIGN KEY (`exhibition_id`) REFERENCES `exhibition_plan` (`exhibition_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 2024024 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '用户预约管理表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of reservation
-- ----------------------------
INSERT INTO `reservation` VALUES (2024019, 1, '林慧怡', '130130200310240018', '15230139856', 'lhyppllyhl@gmail.com', 45, '2026-05-26', 2, '2026-05-25 11:56:29', '全天', '学生票', '4E082EA5', '');
INSERT INTO `reservation` VALUES (2024020, 1, '林慧怡', '130130200310240018', '15230139856', 'lhyppllyhl@gmail.com', 47, '2026-05-28', 2, '2026-05-25 14:23:32', '上午入场', '成人票', 'AD1E2453', '');
INSERT INTO `reservation` VALUES (2024022, 1, '林慧怡', '130130199807150018', '15297865126', 'xlakz@gmail.com', 45, '2026-05-26', 2, '2026-05-25 17:24:51', '全天', '成人票', '4B8467A7', '');
INSERT INTO `reservation` VALUES (2024023, 1, '林慧怡', '130130199807150018', '15297865126', 'xlakz@gmail.com', 49, '2026-05-27', 1, '2026-05-26 10:32:23', '全天', '成人票', '8BED13DD', '');

-- ----------------------------
-- Table structure for shop_cart
-- ----------------------------
DROP TABLE IF EXISTS `shop_cart`;
CREATE TABLE `shop_cart`  (
  `cart_id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL,
  `product_id` bigint NOT NULL,
  `quantity` int NULL DEFAULT 1,
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  `sku_id` bigint NULL DEFAULT NULL COMMENT 'SKU ID',
  `sku_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '规格名称',
  PRIMARY KEY (`cart_id`) USING BTREE,
  UNIQUE INDEX `uk_user_product_sku`(`user_id` ASC, `product_id` ASC, `sku_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 17 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '购物车表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of shop_cart
-- ----------------------------
INSERT INTO `shop_cart` VALUES (15, 1, 9, 1, '2026-05-25 22:10:07', 37, NULL);
INSERT INTO `shop_cart` VALUES (16, 1, 8, 4, '2026-05-25 22:10:51', 34, NULL);

-- ----------------------------
-- Table structure for shop_category
-- ----------------------------
DROP TABLE IF EXISTS `shop_category`;
CREATE TABLE `shop_category`  (
  `cat_id` bigint NOT NULL AUTO_INCREMENT,
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '分类名称',
  `icon` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '分类图标URL',
  `sort` int NULL DEFAULT 0 COMMENT '排序',
  PRIMARY KEY (`cat_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '商品分类表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of shop_category
-- ----------------------------
INSERT INTO `shop_category` VALUES (1, '书籍', NULL, 0);
INSERT INTO `shop_category` VALUES (2, '明信片', NULL, 2);
INSERT INTO `shop_category` VALUES (3, '模型', NULL, 1);
INSERT INTO `shop_category` VALUES (4, '其它', NULL, 4);
INSERT INTO `shop_category` VALUES (5, '文具', NULL, 0);
INSERT INTO `shop_category` VALUES (6, '摆件', NULL, 3);
INSERT INTO `shop_category` VALUES (7, '冰箱贴', NULL, 0);
INSERT INTO `shop_category` VALUES (8, '联名周边', NULL, 0);
INSERT INTO `shop_category` VALUES (9, '服装', NULL, 0);

-- ----------------------------
-- Table structure for shop_order
-- ----------------------------
DROP TABLE IF EXISTS `shop_order`;
CREATE TABLE `shop_order`  (
  `order_id` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '订单号',
  `user_id` bigint NOT NULL,
  `total_price` decimal(10, 2) NOT NULL COMMENT '订单总价',
  `status` tinyint NULL DEFAULT 0 COMMENT '0-待付款 1-待发货 2-待收货 3-已完成 4-已取消 5-退款中 6-已退款',
  `addr_id` bigint NULL DEFAULT NULL COMMENT '收货地址ID',
  `receiver` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '冗余收货人',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '冗余电话',
  `address` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '冗余完整地址',
  `remark` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `pay_time` datetime NULL DEFAULT NULL,
  `ship_time` datetime NULL DEFAULT NULL,
  `finish_time` datetime NULL DEFAULT NULL,
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  `refund_reason` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '退款原因',
  `refund_remark` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '管理员处理备注',
  `refund_time` datetime NULL DEFAULT NULL COMMENT '退款处理时间',
  `prev_status` tinyint NULL DEFAULT NULL COMMENT '退款前的订单状态',
  PRIMARY KEY (`order_id`) USING BTREE,
  INDEX `user_id`(`user_id` ASC) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '订单表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of shop_order
-- ----------------------------
INSERT INTO `shop_order` VALUES ('ORD1779703077978', 1, 110.00, 3, 1, '王小明', '15230139856', '河北省翻斗市翻斗区翻斗花园', '', '2026-05-25 17:58:01', NULL, '2026-05-25 18:14:45', '2026-05-25 17:57:58', NULL, NULL, NULL, NULL);
INSERT INTO `shop_order` VALUES ('ORD1779718262453', 1, 670.00, 3, 2, '林慧怡', '15230139856', '河北省石家庄市长安区长安小区一号楼', '', '2026-05-25 22:11:05', NULL, '2026-05-25 22:11:30', '2026-05-25 22:11:02', NULL, NULL, NULL, NULL);

-- ----------------------------
-- Table structure for shop_order_item
-- ----------------------------
DROP TABLE IF EXISTS `shop_order_item`;
CREATE TABLE `shop_order_item`  (
  `item_id` bigint NOT NULL AUTO_INCREMENT,
  `order_id` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `product_id` bigint NOT NULL,
  `product_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '冗余商品名',
  `cover_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '冗余图片',
  `price` decimal(10, 2) NOT NULL COMMENT '下单时价格',
  `quantity` int NOT NULL,
  `belong_museum` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '冗余所属博物馆',
  `item_status` tinyint NULL DEFAULT 0 COMMENT '0-待发货 1-已发货 2-已完成 3-已取消',
  `ship_time` datetime NULL DEFAULT NULL COMMENT '发货时间',
  `finish_time` datetime NULL DEFAULT NULL COMMENT '完成时间',
  PRIMARY KEY (`item_id`) USING BTREE,
  INDEX `order_id`(`order_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 20 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '订单明细表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of shop_order_item
-- ----------------------------
INSERT INTO `shop_order_item` VALUES (1, 'ORD1777992016560', 1, '测试文物', '', 1.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (2, 'ORD1777998018814', 2, '【热门推荐】《故宫翰墨》家长陪伴必备读物！最佳伴手礼，热门爆款', 'http://localhost:8080/files/57d95c10-bba3-4e39-bf60-2a3118b48e8e.png', 50.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (3, 'ORD1777998018814', 3, '精美明信片五张', 'http://localhost:8080/files/c9d10aa1-c400-4070-9daa-8df74875c53a.png', 20.00, 1, '河北博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (4, 'ORD1778037294046', 5, '测试文物商品', 'http://localhost:8080/files/9f7843e8-4d0e-4d45-956a-c479d4fb8afd.png', 0.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (5, 'ORD1778037647403', 5, '测试文物商品', 'http://localhost:8080/files/9f7843e8-4d0e-4d45-956a-c479d4fb8afd.png', 0.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (6, 'ORD1778038195121', 5, '测试文物商品', 'http://localhost:8080/files/9f7843e8-4d0e-4d45-956a-c479d4fb8afd.png', 0.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (7, 'ORD1778039029822', 5, '测试文物商品', 'http://localhost:8080/files/9f7843e8-4d0e-4d45-956a-c479d4fb8afd.png', 0.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (8, 'ORD1778039293193', 5, '测试文物商品', 'http://localhost:8080/files/9f7843e8-4d0e-4d45-956a-c479d4fb8afd.png', 50.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (9, 'ORD1778039863235', 5, '测试文物商品', 'http://localhost:8080/files/9f7843e8-4d0e-4d45-956a-c479d4fb8afd.png', 40.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (10, 'ORD1778039882788', 5, '测试文物商品', 'http://localhost:8080/files/9f7843e8-4d0e-4d45-956a-c479d4fb8afd.png', 40.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (11, 'ORD1778142631459', 5, '测试文物商品', 'http://localhost:8080/files/9f7843e8-4d0e-4d45-956a-c479d4fb8afd.png', 40.00, 1, '广东省博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (12, 'ORD1778149007385', 6, '精美挂画', 'http://localhost:8080/files/669f5f50-b2d9-47b9-a947-a9870f630730.jpg', 30.00, 1, '河北博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (13, 'ORD1778918606843', 6, '精美挂画', 'http://localhost:8080/files/669f5f50-b2d9-47b9-a947-a9870f630730.jpg', 50.00, 1, '河北博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (14, 'ORD1779701924867', 3, '精美明信片五张', 'http://localhost:8080/files/c9d10aa1-c400-4070-9daa-8df74875c53a.png', 20.00, 1, '河北博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (15, 'ORD1779701924867', 6, '精美挂画', 'http://localhost:8080/files/9ee64a21-f375-4f96-adac-2d392cbdea44.png', 20.00, 2, '河北博物馆', 0, NULL, NULL);
INSERT INTO `shop_order_item` VALUES (16, 'ORD1779703077978', 6, '精美挂画', 'http://localhost:8080/files/9ee64a21-f375-4f96-adac-2d392cbdea44.png', 50.00, 1, '河北博物馆', 2, '2026-05-25 17:58:31', '2026-05-25 18:14:45');
INSERT INTO `shop_order_item` VALUES (17, 'ORD1779703077978', 7, '【广博×故宫联名】故宫翰墨', 'http://localhost:8080/files/3b0ba580-cc33-48a8-9b7d-c99c8bd0f500.png', 50.00, 1, '广东省博物馆', 2, '2026-05-25 18:14:37', '2026-05-25 18:14:45');
INSERT INTO `shop_order_item` VALUES (18, 'ORD1779718262453', 8, '\"清代山水 · 浮雕印花\"主题文化衫', 'http://localhost:8080/files/5c480034-eca8-4f56-aea6-eeb40f8843b6.png', 149.00, 4, '上海博物馆', 2, '2026-05-25 22:11:23', '2026-05-25 22:11:30');
INSERT INTO `shop_order_item` VALUES (19, 'ORD1779718262453', 9, '金石文化棒球帽', 'http://localhost:8080/files/b0243644-cba9-4aa1-b784-55eb7a6fde3f.png', 59.00, 1, '上海博物馆', 2, '2026-05-25 22:11:23', '2026-05-25 22:11:30');

-- ----------------------------
-- Table structure for shop_product
-- ----------------------------
DROP TABLE IF EXISTS `shop_product`;
CREATE TABLE `shop_product`  (
  `product_id` bigint NOT NULL AUTO_INCREMENT,
  `cat_id` bigint NULL DEFAULT NULL COMMENT '分类ID',
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '商品名称',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '商品描述',
  `price` decimal(10, 2) NOT NULL COMMENT '价格',
  `stock` int NULL DEFAULT 0 COMMENT '库存',
  `stock_warning` int NULL DEFAULT 10 COMMENT '库存预警阈值',
  `cover_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '主图',
  `images` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '图片列表(JSON数组)',
  `type` tinyint NULL DEFAULT 0 COMMENT '0-实体 1-虚拟',
  `status` tinyint NULL DEFAULT 1 COMMENT '0-下架 1-上架',
  `belong_museum` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '所属博物馆',
  `admin_id` bigint NOT NULL COMMENT '发布者ID',
  `sales` int NULL DEFAULT 0 COMMENT '销量',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  `is_free_shipping` tinyint NULL DEFAULT 0 COMMENT '是否包邮 0-否 1-是',
  `has_shipping_insurance` tinyint NULL DEFAULT 0 COMMENT '是否含运费险 0-否 1-是',
  `shipping_fee` decimal(10, 2) NULL DEFAULT 0.00 COMMENT '运费金额，0表示包邮',
  PRIMARY KEY (`product_id`) USING BTREE,
  INDEX `cat_id`(`cat_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '商品表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of shop_product
-- ----------------------------
INSERT INTO `shop_product` VALUES (1, 1, '测试文物', '好看的书籍', 1.00, 8, 10, 'http://localhost:8080/files/847fbdee-d367-46e9-a21f-089ab2b20d41.jpg', NULL, 0, 0, '广东省博物馆', 6, 1, '2026-05-05 22:38:44', 0, 0, 0.00);
INSERT INTO `shop_product` VALUES (2, 1, '【热门推荐】《故宫翰墨》家长陪伴必备读物！最佳伴手礼，热门爆款', '【热门推荐】《故宫翰墨》家长陪伴必备读物！最佳伴手礼，热门爆款', 50.00, 24, 10, 'http://localhost:8080/files/57d95c10-bba3-4e39-bf60-2a3118b48e8e.png', NULL, 0, 0, '广东省博物馆', 6, 1, '2026-05-06 00:10:08', 0, 0, 0.00);
INSERT INTO `shop_product` VALUES (3, 2, '精美明信片五张', '精美明信片五张', 20.00, 18, 10, 'http://localhost:8080/files/c9d10aa1-c400-4070-9daa-8df74875c53a.png', NULL, 0, 1, '河北博物馆', 3, 2, '2026-05-06 00:17:47', 0, 0, 0.00);
INSERT INTO `shop_product` VALUES (4, 1, '青铜器小手半', '青铜器小手半', 30.00, 50, 10, 'http://localhost:8080/files/2fee63f7-ba44-48f5-8f3a-ceee1b882190.png', NULL, 0, 0, '广东省博物馆', 6, 0, '2026-05-06 10:28:43', 0, 1, 0.00);
INSERT INTO `shop_product` VALUES (5, 4, '测试文物商品', '<p>测试文物商品</p><p><strong>测试文物商品</strong></p><p><u>测试文物商品</u></p><h1>测试文物商品</h1><p><img src=\"http://localhost:8080/files/ac549aae-a017-4239-b237-ee5044b04202.png\"></p>', 30.00, 84, 10, 'http://localhost:8080/files/9f7843e8-4d0e-4d45-956a-c479d4fb8afd.png', NULL, 0, 0, '广东省博物馆', 6, 6, '2026-05-06 10:45:39', 0, 0, 12.00);
INSERT INTO `shop_product` VALUES (6, 4, '精美挂画', '<h1>🖼️ 【燕赵风骨·古今画卷】系列高端艺术微喷挂画</h1><blockquote><strong>把博物馆的惊艳，留给自家的墙壁。</strong></blockquote><blockquote>传世翰墨，落户寻常。我们精选本次“河北博物馆古今画卷展览”中备受瞩目的核心视觉，采用现代顶尖复刻工艺，将千百年前的墨色风骨与现代艺术的视觉张力，转化为点缀您家居空间的绝美雅器。</blockquote><h3>🎨 核心款式 · 艺术档案</h3><h3><strong>款式名称意境定位适合空间《千里江山·青绿华章》</strong>气势磅礴，开阔胸襟客厅背景墙、大堂、书房<strong>《歌乐图·宋韵丝竹》</strong>清雅内敛，富有市井烟火与宫廷雅趣茶室、餐厅、玄关<strong>《五四青年·觉醒时代》</strong>现代时尚，热血张扬，极具视觉冲击力艺术工作室、现代极简客厅、书房<strong>《水墨老人·岁月沉淀》</strong>禅意留白，写意人生，尽显东方智慧禅修室、茶空间、长辈房🔍 匠心工艺 · 硬核科普</h3><p>为了完美还原原作的气韵，我们拒绝流水线式的粗糙印刷，死磕每一个工艺细节：</p><ul><li><strong>12色超高清艺术微喷（Giclée）</strong></li><li>采用专业级艺术微喷技术，色彩馆藏级还原。无论是《千里江山》中孔雀石与蓝铜矿的<strong>层层敷色</strong>，还是水墨老人中“墨分五色”的干湿浓淡，均能纤毫毕现，直逼原作神韵。</li><li><strong>精选特级宣纸/高档棉质油画布</strong></li><li>根据画作风格定制材质。古风系列采用<strong>抗噪、防霉的特制宣纸纹理纸</strong>，保留宣纸独有的洇散感；现代艺术系列采用<strong>高密度防水油画布</strong>，肌理感强，色彩饱满。</li><li><strong>环保矿物墨水 · 百年不褪色</strong></li><li>使用纯天然、无毒无味的环保矿物墨水。防紫外线、耐光照，真正做到“白青相映，历久弥新”，可传家、可收藏。</li><li><strong>高端实木画框 · 匠心榫卯</strong></li><li>选用进口黑胡桃木/水曲柳实木画框，经多道手工打磨抛光，线条硬朗。采用传统<strong>榫卯结构</strong>固定，严丝合缝，久用不易变形。</li></ul><h3>📐 商品规格参数</h3><ul><li><strong>画芯材质</strong>：特级艺术宣纸纸本 / 哑光高质感油画布</li><li><strong>外框材质</strong>：黑胡桃木色实木框 / 哑光现代黑铝合金框</li><li><strong>工艺类型</strong>：馆藏级艺术微喷（配3mm高透防眩光有机玻璃）</li><li><strong>常用尺寸</strong>（支持私信定制）：</li><li class=\"ql-indent-1\"><strong>横幅长卷</strong>：$120\\text{cm} \\times 45\\text{cm}$ / $150\\text{cm} \\times 55\\text{cm}$（完美还原长卷气象）</li><li class=\"ql-indent-1\"><strong>竖幅方版</strong>：$50\\text{cm} \\times 70\\text{cm}$ / $60\\text{cm} \\times 90\\text{cm}$</li><li><strong>包装附件</strong>：品牌专属礼盒、定制防跌落无痕钉、水平仪、纯棉白手套。</li></ul><h3>🏠 场景秀：一幅好画，如何改变一个家？</h3><blockquote><strong>“计白当黑，虚实相生。”</strong></blockquote><ul><li><strong>客厅 · 撑起家的气度</strong>：一幅《千里江山》，连绵的青绿山水在沙发后延展，不仅是视觉焦点，更是主人胸怀与审美品味的无声宣告。</li><li><strong>书房 · 独享一室清幽</strong>：挂一幅《水墨老人》或赵佶草书，展卷迎风，一盏清茶。在疾风劲草般的线条里，找回内心的宁静与笃定。</li><li><strong>玄关 · 开门见喜的惊艳</strong>：现代红蓝撞色的《五四青年》，让每一个推门而入的客人，瞬间感受到现代艺术的张力与扑面而来的朝气。</li></ul><h3>📦 购物保障与物流</h3><ul><li><strong>顺丰包邮</strong>：全产业链顺丰加固木架包装，确保艺术品完好无损送达您的手中。</li><li><strong>破损包退</strong>：物流途中若有任何磕碰损坏，请在签收24小时内联系客服，我们将免费为您重新顺丰补发。</li></ul><blockquote><strong>限时福利</strong>：</blockquote><blockquote>凡本次“河北博物馆巡展”期间在线上或展会现场下单的观众，均可获赠<strong>展览官方限量版纪念画册一本</strong>及<strong>文创书签一枚</strong>。数量有限，赠完即止。</blockquote><p><br></p>', 20.00, 95, 10, 'http://localhost:8080/files/9ee64a21-f375-4f96-adac-2d392cbdea44.png', NULL, 0, 1, '河北博物馆', 3, 4, '2026-05-06 12:15:58', 0, 0, 10.00);
INSERT INTO `shop_product` VALUES (7, 1, '【广博×故宫联名】故宫翰墨', '<h2>🌟 【广博×故宫联名】故宫翰墨 —— 双城璧合，尽显中华文脉之美</h2><p>当岭南文化窗口「广东省博物馆」<strong>与</strong>六百年皇家美学「故宫博物院」破壁相遇，一场跨越地理限制的南北文化碰撞交融于此。</p><p>「故宫翰墨」联名系列商品，将故宫馆藏的绝美书画珍玩，与广东省博物馆所承载的地域文化、文雅生活美学精妙结合。它不仅是一件商品，更是一部可以握在手中、摆在案头的“流动的博物馆展厅”。</p><h3>🎨 核心亮点与文化内涵</h3><ul><li><strong>双馆正版背书，文化含金量“天花板”</strong></li><li>由广东省博物馆与故宫文创联合打造，设计灵感源自两馆珍藏的国宝级书画、墨宝及宫廷纹样。南北文化交相辉映，正统且极具收藏价值。</li><li><strong>南北美学碰撞，雅致超脱</strong></li><li>既有故宫海纳百川的皇家大气、厚重翰墨，又融入了广博海丝文化、岭南文脉的精致与细腻。将传统的“琴棋书画诗酒茶”现代生活化，尽显文人雅趣。</li><li><strong>匠心工艺还原，细节处见真章</strong></li><li>产品采用高精度印刷与考究的材质工艺（如浮雕、烫金、丝绸质感等），近乎完美地还原了古代书画的墨韵与色彩，让千年文脉触手可及。</li><li><strong>兼具实用与格调，送礼典藏皆宜</strong></li><li>该系列涵盖了文房雅玩、生活美学用品等。无论是摆在书房彰显品味，还是作为一份沉甸甸的文化礼品赠送给导师、藏友、贵客，都极具文化分量。</li></ul><h3>🏛️ 「双城故事」设计元素</h3><p><strong>灵感来源文化意象产品视觉呈现故宫·皇家翰墨</strong>馆藏历代名家书画真迹、帝王墨宝。苍劲磅礴的笔触、经典的宫廷配色，彰显正统大气。<strong>广博·岭南文脉</strong>粤地文人墨客的诗雅情怀、岭南特色藏品元素。细腻婉约的纹理、内敛的东方韵味，平添一分灵动。</p><h3>💡 为什么值得拥有？</h3><blockquote>“从紫禁城到岭南，跨越千里的文化共鸣，都在这一笔一墨之间。”</blockquote><p>「故宫翰墨」系列不仅仅是一件文创，它承载的是两大博物馆对中华优秀传统文化的守护与活化。它打破了文物的冰冷玻璃罩，让那些在历史长河中熠熠生辉的墨迹与审美，真正走入你的日常生活。</p><p><strong>手触双馆匠心，落墨中华意境。</strong></p><p>👉 <em>立即将这份跨越时空的“博物馆级”浪漫带回家！</em></p>', 50.00, 99, 10, 'http://localhost:8080/files/3b0ba580-cc33-48a8-9b7d-c99c8bd0f500.png', NULL, 0, 1, '广东省博物馆', 6, 1, '2026-05-25 17:46:06', 1, 1, 0.00);
INSERT INTO `shop_product` VALUES (8, 9, '\"清代山水 · 浮雕印花\"主题文化衫', '<h1> 上海博物馆特献 ·【浮生墨白】清代山水浮雕印花文化衫</h1><blockquote><strong>设计自白</strong>： 物质的繁华终会散去，但胸中的山水永远挺拔。本款文化衫以广东省博物馆藏国家级珍贵文物——**《清 · 端石千岩竞秀砚》**为灵感源泉。设计师打破了传统文物文创只是“平面复印”的敷衍手法，将清代文人最核心的精神图腾——“案头清供的山水丘壑”，通过当代重装纺织与微浮雕工艺，转化为一件可以穿在身上的“文人战袍”。</blockquote><h2><img src=\"http://localhost:8080/files/b6a5d4d9-e683-495c-ab68-f6c2e68d4bdb.png\"></h2><h2> </h2><h2>核心设计美学解构</h2><p><br></p><p>		这件文化衫不只是一件衣物，更是将清代文人的风骨与宿命，穿在身上的美学宣言。衣服胸前摒弃了敷衍的普通胶印，重金采用<strong>立体发泡浮雕工艺</strong>，将广东省博物馆藏“清端石千岩竞秀砚”上那幅重峦叠嶂、古木幽深的宏大山水，以微观立体的形式于布料上重塑。当指墨相发，你的指尖抚摸上去，能清晰地感受到如同古代老坑端砚般斑驳、凹凸有致的细腻石质肌理——纵使外界风雨大作、世俗喧嚣，而你胸中自有一派不畏风霜的苍翠山水。</p><p>		在色彩的克制上，衣服融入了<strong>极简主义的墨白双色</strong>：<strong>“墨黑”取自古墨研磨入宣纸时的深邃，绝非市面上普通的死黑，而是带着历史厚重感与文人内敛气质的隐逸焦墨；“纸白”则取自天然生宣历经岁月洗礼后的微微米白，温润、不刺眼，如同清晨书斋窗棂里折射出的一缕晨光。更有极为考究的金石微章</strong>隐藏于衣服后颈处，低调刺绣着一枚复刻自清代文人藏书印的“墨润”小方印。</p><p>		提笔执墨，落暮皆情。后人视之，唯见背影，便已读懂你骨子里那份不随波逐流的文人风雅。</p><h2><br></h2><h2>匠心版型与面料工艺</h2><p>为了承载这份文化的厚度，我们在面料的编织和剪裁上同样追求清代手工业巅峰时的执着：</p><p><br></p><p><strong>260g 双纱精梳纯棉</strong>： 精选长绒棉，260克重磅厚质面料。上身挺括有型，绝不松垮塌陷。它就像文人的骨气一样，历经多次洗涤依然挺拔，自带一种高阶的“重装质感”。</p><p><img src=\"http://localhost:8080/files/3aa5f1dd-4695-4a45-b9c0-806de0c2410e.png\"></p><p><strong>液氨食毛工艺</strong>： 面料表面经过液氨整理与微食毛技术，去除了所有多余的棉毛屑。衣服表面带有如同顶级绢素和温润端砚般的淡淡微光，触感亲肤细腻，吸汗透气。</p><p><img src=\"http://localhost:8080/files/328ff851-5876-426e-8a80-af3360553010.png\"></p><ul><li><strong>【文人廓形】海派宽松剪裁</strong>： 采用上博标志性的海派落肩微宽松版型。不挑身材，包容度极高。无论是日常办公作为内搭，还是周末出行文艺出街，都能穿出一种落落大方、松弛随性的文人风度。</li></ul><h2><br></h2><h2> 商品基础规格参数</h2><ul><li><strong>产品名称</strong>：【繁华落尽·墨润浮生】清代山水浮雕印花文化衫</li><li><strong>面料成分</strong>：100% 精梳纯棉（重磅260g）</li><li><strong>工艺类型</strong>：三维立体发泡浮雕、重工防变形领条、高精数码活性印染</li><li><strong>可选颜色</strong>：焦墨黑 / 宣纸白</li><li><strong>尺码推荐</strong>：S / M / L / XL / XXL（海派宽松版型，男女同款）</li><li><strong>洗涤建议</strong>：为保护胸前珍贵的浮雕山水肌理，建议反面手洗或装入洗衣袋后轻柔机洗，请勿暴晒。</li></ul><p><br></p>', 1.01, 166, 10, 'http://localhost:8080/files/5c480034-eca8-4f56-aea6-eeb40f8843b6.png', NULL, 0, 1, '上海博物馆', 10, 4, '2026-05-25 22:02:59', 0, 0, 15.00);
INSERT INTO `shop_product` VALUES (9, 9, '金石文化棒球帽', '<h3>上海博物馆特献 ·【金石骨气】汉隶张迁碑刺绣棒球帽</h3><p>设计自白： 文人的骨气，从不流于表面，而是刻进骨血、顶在头上的傲然。本款限定棒球帽以展厅中的金石重器——上海博物馆藏《清拓汉张迁碑册》为美学蓝本。设计师打破了传统文创只是死板复印文字的套路，截取了汉隶中最具现代骨骼感的标志性笔触，将跨越千年的金石风骨，转化为当代街头最硬朗的时尚符号。</p><p><img src=\"http://localhost:8080/files/d300ee1c-d3bf-4073-8baa-9cb35dda84f1.png\"></p><p>一、 核心设计美学解构</p><p><br></p><ol><li>【方整雄强】张迁碑汉隶重工刺绣 放弃了冗长的全文印制，设计师在帽子正面仅精选了《张迁碑》中方整质朴、欹侧中有千钧之力的汉隶笔画局部。采用高密度日本田岛绣花工艺，以沉稳的黑白两色丝线，在帽身进行多层叠加上色。笔画的转折处斩钉截铁，横平竖直间带有如刀劈斧凿般的微立体肌理。摸上去是宣纸拓片般的凹凸质感，戴上它，是将千年金石的傲骨与不向流俗低头的骨气，真正顶在头上。</li><li>【岁月的墨痕】复古做旧色系</li></ol><ul><li>碑石黑：还原汉代碑石历经千年的沧桑与深邃，沉稳而冷峻。</li><li>拓片白：取自高质感拓片宣纸的天然米白，纯粹而不张扬。 两款配色皆自带一种复古的洗水做旧质感，恰似一块行走的活字碑刻，极具时间分量。</li></ul><ol><li>【一印永留】后调带金石微章 隐藏细节：帽后可调节扣带处，低调刺绣有一枚复刻自清代文人藏书印的“墨润”小方印。当您留下背影，这枚象征风雅的朱砂红印，便是对您独特文人身份的审美盖签。</li></ol><p>二、 匠心版型与面料工艺</p><p>为了配得上金石的硬朗，我们在帽子的版型与面料上同样追求极致：</p><p><br></p><ul><li>【重装风骨】16安重磅硬挺水洗纯棉帆布： 精选高密度重磅帆布面料，经过特殊的文人洗水工艺处理，触感扎实、不易变形。像文人的脊梁一样，历经风雨摩擦，依然保持硬挺的廓形。</li><li>【海派修颜】亚洲定制版硬顶帽型： 前片采用高规格的硬顶定型结构，深度契合亚洲人头型设计。视觉上具有极佳的显脸小效果，拉长面部线条，无论正戴还是反戴，都能穿出一种松弛随性却不失锋芒的文人风度。</li><li>【清爽书斋】六孔透气与吸汗带圈： 帽身分布六个重工绣花透气孔，内里搭配纯棉高弹吸汗带，吸湿排汗。即使在炎炎夏日出行，也能让你的头部如置身清幽书斋般，时刻保持冷静与舒适。</li><li><img src=\"http://localhost:8080/files/df835983-bcae-46de-ba1a-2dbac8512fb5.png\"></li></ul><p>三、 商品基础规格参数</p><p><br></p><ul><li>产品名称：【繁华落尽·墨润浮生】汉隶张迁碑刺绣棒球帽</li><li>面料成分：100% 重磅水洗棉（16安帆布）</li><li>工艺类型：高密度3D金石刺绣、金属调节扣（后带可调）</li><li>可选颜色：碑石黑 / 拓片白</li><li>尺码推荐：均码（头围 54cm-60cm 可自由调节，男女同款）</li><li>洗涤建议：为保护前片硬顶版型及珍贵的金石刺绣，建议局部沾水手洗，切勿直接丢进洗衣机绞洗。</li></ul><p><br></p>', 0.00, 219, 10, 'http://localhost:8080/files/b0243644-cba9-4aa1-b784-55eb7a6fde3f.png', NULL, 0, 1, '上海博物馆', 10, 1, '2026-05-25 22:09:19', 1, 0, 0.00);

-- ----------------------------
-- Table structure for shop_product_sku
-- ----------------------------
DROP TABLE IF EXISTS `shop_product_sku`;
CREATE TABLE `shop_product_sku`  (
  `sku_id` bigint NOT NULL AUTO_INCREMENT,
  `product_id` bigint NOT NULL,
  `sku_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'SKU名称，如：甲款-红色',
  `price` decimal(10, 2) NOT NULL COMMENT 'SKU价格',
  `stock` int NULL DEFAULT 0 COMMENT 'SKU库存',
  `stock_warning` int NULL DEFAULT 10,
  `cover_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'SKU图片',
  PRIMARY KEY (`sku_id`) USING BTREE,
  INDEX `product_id`(`product_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 38 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '商品SKU表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of shop_product_sku
-- ----------------------------
INSERT INTO `shop_product_sku` VALUES (10, 5, '大', 50.00, 29, 10, NULL);
INSERT INTO `shop_product_sku` VALUES (11, 5, '中', 40.00, 27, 10, NULL);
INSERT INTO `shop_product_sku` VALUES (12, 5, '小', 30.00, 30, 10, NULL);
INSERT INTO `shop_product_sku` VALUES (28, 6, '大', 50.00, 18, 10, 'http://localhost:8080/files/00a7a723-adf2-4761-bac2-e977bd5a8f22.png');
INSERT INTO `shop_product_sku` VALUES (29, 6, '中', 30.00, 19, 10, 'http://localhost:8080/files/16456fcc-9483-4b74-a744-2141e680d982.png');
INSERT INTO `shop_product_sku` VALUES (30, 6, '小', 20.00, 60, 10, 'http://localhost:8080/files/106eeced-3063-445f-99e9-91ec39a76000.png');
INSERT INTO `shop_product_sku` VALUES (31, 8, 'S', 149.00, 30, 10, NULL);
INSERT INTO `shop_product_sku` VALUES (32, 8, 'M', 149.00, 30, 10, NULL);
INSERT INTO `shop_product_sku` VALUES (33, 8, 'L', 149.00, 40, 10, NULL);
INSERT INTO `shop_product_sku` VALUES (34, 8, 'XL', 149.00, 36, 10, NULL);
INSERT INTO `shop_product_sku` VALUES (35, 8, 'XXL', 149.00, 30, 10, NULL);
INSERT INTO `shop_product_sku` VALUES (36, 9, '墨黑', 59.00, 120, 10, 'http://localhost:8080/files/6c0eae10-4588-457d-adab-c7799da542eb.png');
INSERT INTO `shop_product_sku` VALUES (37, 9, '绛红', 59.00, 99, 10, 'http://localhost:8080/files/cd32453f-c30e-4b4d-af56-0a4b052c5709.png');

-- ----------------------------
-- Table structure for shop_product_spec
-- ----------------------------
DROP TABLE IF EXISTS `shop_product_spec`;
CREATE TABLE `shop_product_spec`  (
  `spec_id` bigint NOT NULL AUTO_INCREMENT,
  `product_id` bigint NOT NULL COMMENT '关联商品',
  `spec_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '规格名，如：款式、颜色',
  `spec_values` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '规格值JSON数组，如：[\"甲款\",\"乙款\"]',
  PRIMARY KEY (`spec_id`) USING BTREE,
  INDEX `product_id`(`product_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 13 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '商品规格表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of shop_product_spec
-- ----------------------------
INSERT INTO `shop_product_spec` VALUES (4, 5, '大小', '[\"大\",\"中\",\"小\"]');
INSERT INTO `shop_product_spec` VALUES (10, 6, '大小', '[\"大\",\"中\",\"小\"]');
INSERT INTO `shop_product_spec` VALUES (11, 8, '款式', '[\"S\",\"M\",\"L\",\"XL\",\"XXL\"]');
INSERT INTO `shop_product_spec` VALUES (12, 9, '颜色', '[\"墨黑\",\"绛红\"]');

-- ----------------------------
-- Table structure for shop_review
-- ----------------------------
DROP TABLE IF EXISTS `shop_review`;
CREATE TABLE `shop_review`  (
  `review_id` bigint NOT NULL AUTO_INCREMENT,
  `order_id` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `product_id` bigint NOT NULL,
  `user_id` bigint NOT NULL,
  `rating` tinyint NULL DEFAULT 5 COMMENT '评分1-5',
  `content` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '评价内容',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`review_id`) USING BTREE,
  UNIQUE INDEX `uk_order_product`(`order_id` ASC, `product_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '商品评价表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of shop_review
-- ----------------------------
INSERT INTO `shop_review` VALUES (1, 'ORD1777998018814', 2, 1, 4, '非常好', '2026-05-06 11:59:03');
INSERT INTO `shop_review` VALUES (2, 'ORD1777998018814', 3, 1, 5, '不错不错，孩子很喜欢', '2026-05-06 11:59:03');
INSERT INTO `shop_review` VALUES (3, 'ORD1778918606843', 6, 1, 5, '非常好看的明信片', '2026-05-16 16:04:29');

-- ----------------------------
-- Table structure for sys_user
-- ----------------------------
DROP TABLE IF EXISTS `sys_user`;
CREATE TABLE `sys_user`  (
  `user_id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `username` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户名/账号',
  `password` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '密码',
  `nickname` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '昵称/姓名',
  `role` enum('USER','APPLICANT','ADMIN','SHOP_ADMIN','SUPER_ADMIN') CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'USER',
  `belong` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '所属博物馆',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '手机号',
  `email` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '邮箱',
  `avatar` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '头像URL',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`user_id`) USING BTREE,
  UNIQUE INDEX `username`(`username` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 12 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '用户信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_user
-- ----------------------------
INSERT INTO `sys_user` VALUES (1, 'user1', '123456', '爱看展的小林同学', 'USER', '用户', '15239874589', 'xiaolin_@gmail.com', 'http://localhost:8080/files/577d5bc7-cbab-49e4-9f6f-b901dfd719b6.jpg', '2026-02-23 15:15:01', '2026-05-25 22:40:30');
INSERT INTO `sys_user` VALUES (2, 'app1', '123456', '河北博物馆策划部', 'APPLICANT', '河北博物馆', NULL, NULL, NULL, '2026-02-23 15:15:01', '2026-05-07 17:41:55');
INSERT INTO `sys_user` VALUES (3, 'admin1', '123456', '河北博物馆管理员', 'ADMIN', '河北博物馆', NULL, NULL, NULL, '2026-02-23 15:15:01', '2026-05-06 01:05:19');
INSERT INTO `sys_user` VALUES (6, 'admin2', '123456', '广博管理员', 'ADMIN', '广东省博物馆', NULL, NULL, NULL, '2026-05-04 00:23:49', '2026-05-25 17:26:26');
INSERT INTO `sys_user` VALUES (8, 'xiaowang', '147258', '广博策展人', 'APPLICANT', '广东博物馆', '15234228026', 'xwcz@gmail.com', NULL, '2026-05-06 19:20:13', '2026-05-25 20:00:13');
INSERT INTO `sys_user` VALUES (9, 'superadmin', '123456', '站点管理员', 'SUPER_ADMIN', '系统', NULL, NULL, NULL, '2026-05-07 16:59:36', '2026-05-07 16:59:36');
INSERT INTO `sys_user` VALUES (10, 'admin3', '123456', '上海博物馆管理员', 'ADMIN', '上海博物馆', '', '', NULL, '2026-05-16 15:46:34', '2026-05-16 15:46:34');
INSERT INTO `sys_user` VALUES (11, 'app_shanghai', '123456', '上海策展人', 'APPLICANT', '上海博物馆', '', '', NULL, '2026-05-06 19:20:13', '2026-05-25 20:00:13');

-- ----------------------------
-- Table structure for user_address
-- ----------------------------
DROP TABLE IF EXISTS `user_address`;
CREATE TABLE `user_address`  (
  `addr_id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL,
  `receiver` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '收货人',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '联系电话',
  `province` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `city` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `district` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `detail` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '详细地址',
  `is_default` tinyint NULL DEFAULT 0 COMMENT '是否默认',
  PRIMARY KEY (`addr_id`) USING BTREE,
  INDEX `user_id`(`user_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '收货地址表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user_address
-- ----------------------------
INSERT INTO `user_address` VALUES (1, 1, '王小明', '15230139856', '河北省', '翻斗市', '翻斗区', '翻斗花园', 0);
INSERT INTO `user_address` VALUES (2, 1, '林慧怡', '15230139856', '河北省', '石家庄市', '长安区', '长安小区一号楼', 1);

-- ----------------------------
-- Table structure for user_fav_artifact
-- ----------------------------
DROP TABLE IF EXISTS `user_fav_artifact`;
CREATE TABLE `user_fav_artifact`  (
  `fav_id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `artifact_id` bigint NOT NULL COMMENT '文物ID',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP COMMENT '收藏时间',
  PRIMARY KEY (`fav_id`) USING BTREE,
  UNIQUE INDEX `uk_user_artifact`(`user_id` ASC, `artifact_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 29 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user_fav_artifact
-- ----------------------------
INSERT INTO `user_fav_artifact` VALUES (24, 1, 2, '2026-05-16 14:31:19');
INSERT INTO `user_fav_artifact` VALUES (25, 1, 102, '2026-05-25 19:57:13');
INSERT INTO `user_fav_artifact` VALUES (26, 1, 138, '2026-05-25 19:57:21');
INSERT INTO `user_fav_artifact` VALUES (27, 1, 155, '2026-05-25 19:57:27');
INSERT INTO `user_fav_artifact` VALUES (28, 1, 4, '2026-05-26 18:33:31');

-- ----------------------------
-- Table structure for user_visitor
-- ----------------------------
DROP TABLE IF EXISTS `user_visitor`;
CREATE TABLE `user_visitor`  (
  `visitor_id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL COMMENT '所属用户',
  `real_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '姓名',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '手机号',
  `id_card` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '身份证',
  `email` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '邮箱',
  `is_default` tinyint NULL DEFAULT 0 COMMENT '0-普通 1-默认',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`visitor_id`) USING BTREE,
  INDEX `user_id`(`user_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '常用预约人' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user_visitor
-- ----------------------------
INSERT INTO `user_visitor` VALUES (1, 1, '林慧怡', '15297865126', '130130199807150018', 'xlakz@gmail.com', 1, '2026-05-06 15:20:16');

-- ----------------------------
-- View structure for view_exhibitor_reservation
-- ----------------------------
DROP VIEW IF EXISTS `view_exhibitor_reservation`;
CREATE ALGORITHM = UNDEFINED SQL SECURITY DEFINER VIEW `view_exhibitor_reservation` AS select `r`.`res_id` AS `res_id`,`r`.`user_id` AS `visitor_user_id`,`r`.`real_name` AS `real_name`,`r`.`id_card` AS `id_card`,`r`.`phone` AS `phone`,`r`.`email` AS `email`,`r`.`reserve_date` AS `reserve_date`,`r`.`status` AS `status`,`r`.`time_slot` AS `time_slot`,`r`.`ticket_type` AS `ticket_type`,`r`.`verify_code` AS `verify_code`,`r`.`remark` AS `remark`,`r`.`create_time` AS `create_time`,`ep`.`exhibition_id` AS `exhibition_id`,`ep`.`title` AS `exhibition_title`,`u`.`user_id` AS `exhibitor_user_id`,`u`.`belong` AS `museum_name` from (((`reservation` `r` join `exhibition_plan` `ep` on((`r`.`exhibition_id` = `ep`.`exhibition_id`))) join `exhibition_application` `ea` on((`ep`.`app_id` = `ea`.`app_id`))) join `sys_user` `u` on((`ea`.`applicant_id` = `u`.`user_id`)));

SET FOREIGN_KEY_CHECKS = 1;
